youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
/*
 *  Copyright (c) 2025, The OpenThread Authors.
 *  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimer in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of the copyright holder nor the
 *     names of its contributors may be used to endorse or promote products
 *     derived from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file
 *   This file implements the main OpenThread platform abstraction for radio communication on EFR32.
 *   It provides the core radio API implementation, packet handling, and integration with RAIL.
 */

#include "radio_channel_switching.h"
#include "radio_csl.h"
#include "radio_energy_scan.hpp"
#include "radio_events.h"
#include "radio_instance.h"
#include "radio_interface.h"
#include "radio_security.h"
#include "radio_state.h"
#include <assert.h>
#include <openthread-core-config.h>
#include <openthread-system.h>
#include <openthread/link.h>
#include <openthread/platform/alarm-micro.h>
#include <openthread/platform/alarm-milli.h>
#include <openthread/platform/radio.h>
#include <openthread/platform/time.h>
#include "common/code_utils.hpp"
#include "common/debug.hpp"
#include "common/logging.hpp"
#include "utils/code_utils.h"
#include "utils/link_metrics.h"
#include "utils/mac_frame.h"

extern "C" {
#include "em_device.h"
#include "sl_core.h"
#if defined _SILICON_LABS_32B_SERIES_2
#include "em_system.h"
#else
#include "sl_hal_system.h"
#endif
#include "ieee802154mac.h"
#include "platform-band.h"
#include "platform-efr32.h"
#include "radio_coex.h"
#include "radio_multi_channel.h"
#include "rail_config.h"
#include "sl_memory_manager.h"
#include "sl_packet_utils.h"
#include "sl_rail.h"
#include "sl_rail_ieee802154.h"

#include "sl_openthread_radio_config.h"
#include "sl_rail_util_compatible_pa.h"
#include "soft_source_match_table.h"

#ifdef SL_COMPONENT_CATALOG_PRESENT
#include "sl_component_catalog.h"
#endif // SL_COMPONENT_CATALOG_PRESENT

#ifdef SL_CATALOG_RAIL_MULTIPLEXER_PRESENT
#include "sl_rail_mux_rename.h"
#endif

#ifdef SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT
#include "sl_rail_util_ant_div.h"
#include "sl_rail_util_ant_div_config.h"
#endif // SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
#include "coexistence-802154.h"
#include "coexistence-ot.h"
#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
#include "sl_rail_util_ieee802154_stack_event.h"
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT
#include "sl_rail_util_ieee802154_phy_select.h"
#endif // #ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_FAST_CHANNEL_SWITCHING_PRESENT
#include "sl_rail_util_ieee802154_fast_channel_switching_config.h"
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_FAST_CHANNEL_SWITCHING_PRESENT

#include "circular_queue.h"
#include "radio_power_manager.h"
#include "sl_gp_interface.h"
}

//------------------------------------------------------------------------------
// Enums, macros and static variables

#if SL_OPENTHREAD_RADIO_RX_BUFFER_COUNT > CIRCULAR_QUEUE_LEN_MAX
#error "Rx buffer count cannot be greater than max circular queue length."
#endif

#define US_IN_MS 1000

extern "C" {
void packetSentCallback(bool isAck);
void packetReceivedCallback(void);
void txFailedCallback(bool isAck, uint32_t status);
void ackTimeoutCallback(void);
void dataRequestCommandCallback(sl_rail_handle_t aRailHandle);
void schedulerEventCallback(sl_rail_handle_t aRailHandle);
void sl_ot_update_active_radio_config(void);
}

// Static inline helper - forward declaration
static inline bool txWaitingForAck(void);
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
static bool phyStackEventIsEnabled(void);
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

using rxPacketDetails = struct
{
    uint8_t        length;
    uint8_t        channel;
    uint8_t        lqi;
    int8_t         rssi;
    otInstance    *instance;
    sl_rail_time_t timestamp;
};

typedef struct
{
    rxPacketDetails packetInfo;
    uint8_t         psdu[IEEE802154_MAX_LENGTH];
} rxBuffer;

typedef uint8_t rxBufferIndex_t;

using radioFrame = struct
{
    otRadioFrame frame;
    otInstance  *instance;
    uint8_t      currentRadioTxPriority;
};

static Queue_t          sRxPacketQueue;
static sl_memory_pool_t sRxPacketMemPoolHandle = {};
static uint8_t          sReceiveAckPsdu[IEEE802154_MAX_LENGTH];
static radioFrame       sReceive;
static radioFrame       sReceiveAck;
static otError          sReceiveError;

static radioFrame  sTransmitBuffer[RADIO_REQUEST_BUFFER_COUNT];
static uint8_t     sTransmitPsdu[RADIO_REQUEST_BUFFER_COUNT][IEEE802154_MAX_LENGTH];
static radioFrame *sCurrentTxPacket = nullptr;
static uint8_t     sLastLqi         = 0;
static int8_t      sLastRssi        = 0;
otExtAddress       sExtAddress[RADIO_EXT_ADDR_COUNT];

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
#define IEEE802154_2015_ENH_ACK_TIMING_RX_TO_TX_US 256
#endif
#define CSL_CSMA_BACKOFF_TIME_IN_US 150
sl_rail_csma_config_t csmaConfig    = SL_RAIL_CSMA_CONFIG_802_15_4_2003_2P4_GHZ_OQPSK_CSMA;
sl_rail_csma_config_t cslCsmaConfig = SL_RAIL_CSMA_CONFIG_SINGLE_CCA;

#define SCHEDULE_TX_DELAY_US 3000

#if OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT
static otRadioIeInfo sTransmitIeInfo[RADIO_REQUEST_BUFFER_COUNT];
#endif

#define CCA_THRESHOLD_UNINIT 127

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
extern struct efr32RadioCounters railDebugCounters;
#define rxDebugStep (railDebugCounters.mRadioDebugData.m8[RX_DEBUG_COUNTER0])
#endif

