youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
#define SHR_DURATION_US 160

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
enum
{
    RHO_INACTIVE = 0,
    RHO_EXT_ACTIVE,
    RHO_INT_ACTIVE, // Not used
    RHO_BOTH_ACTIVE,
};

static uint8_t sRhoActive = RHO_INACTIVE;
static bool    sPtaGntEventReported;

#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool rxPacketQueueOverflowCallback(const Queue_t *queue, void *data)
{
    OT_UNUSED_VARIABLE(queue);
    OT_UNUSED_VARIABLE(data);

    return false;
}

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE

// Case 1: Packet was directed towards broadcast address or broadcast PAN ID
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool isFilterMaskBroadcast(uint8_t mask)
{
    return ((mask & RADIO_BCAST_PANID_FILTER_MASK) != 0) || ((mask & RADIO_BCAST_ADDR_FILTER_MASK) != 0);
}

// Case 2: Packet was directed to one of our valid address/PANID combos
// (Compare all non-bcast PANID filters against their corresponding address filters for same IID)
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool isFilterMaskInstanceSpecific(uint8_t mask)
{
    // Find any non-broadcast PAN ID match and compare it to address matches for same IID
    return (((RADIO_GET_PANID_FILTER_MASK(mask) >> RADIO_PANID_FILTER_SHIFT)
             & (RADIO_GET_ADDR_FILTER_MASK(mask) >> RADIO_ADDR_FILTER_SHIFT))
            != 0);
}

// Case 3: Packet is missing either destination addressing field or destination PAN ID
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool isFilterMaskMissingAddressing(uint8_t mask)
{
    return ((RADIO_GET_PANID_FILTER_MASK(mask)) == 0) || ((RADIO_GET_ADDR_FILTER_MASK(mask)) == 0);
}

#endif // OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool isFilterMaskValid(uint8_t mask)
{
#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    return isFilterMaskBroadcast(mask) || isFilterMaskInstanceSpecific(mask) || isFilterMaskMissingAddressing(mask);
#else
    (void)mask;
    return true;
#endif
}

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

// Enhanced ACK IE data
static uint8_t sAckIeData[OT_ACK_IE_MAX_SIZE];
static uint8_t sAckIeDataLength = 0;

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static uint8_t generateAckIeData(otInstance   *aInstance,
                                 uint8_t      *aLinkMetricsIeData,
                                 uint8_t       aLinkMetricsIeDataLen,
                                 otRadioFrame *aReceivedFrame)
{
    OT_UNUSED_VARIABLE(aLinkMetricsIeData);
    OT_UNUSED_VARIABLE(aLinkMetricsIeDataLen);
    OT_UNUSED_VARIABLE(aReceivedFrame);

    uint8_t offset = 0;

    // If instance is nullptr (broadcast packet), skip IE data generation
    otEXPECT(aInstance != nullptr);

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    offset += sli_ot_radio_csl_generate_ack_ie_data(aInstance, aReceivedFrame, sAckIeData);
#endif

#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
    if (aLinkMetricsIeData != nullptr && aLinkMetricsIeDataLen > 0)
    {
        offset += otMacFrameGenerateEnhAckProbingIe(sAckIeData, aLinkMetricsIeData, aLinkMetricsIeDataLen);
    }
#endif

exit:
    return offset;
}

#endif // (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static uint8_t readInitialPacketData(sl_rail_rx_packet_info_t *packetInfo,
                                     uint8_t                   expected_data_bytes_max,
                                     uint8_t                   expected_data_bytes_min,
                                     uint8_t                  *buffer,
                                     uint8_t                   buffer_len)
{
    uint8_t                  packetBytesRead = 0;
    sl_rail_rx_packet_info_t adjustedPacketInfo;

    // Check if we have enough buffer
    OT_ASSERT((buffer_len >= expected_data_bytes_max) || (packetInfo != nullptr));

    // Read the packet info
    sli_ot_radio_interface_rail_get_rx_incoming_packet_info(packetInfo);

    // We are trying to get the packet info of a packet before it is completely received.
    // We do this to evaluate the FP bit in response and add IEs to ACK if needed.
    // Check to see if we have received atleast minimum number of bytes requested.
    otEXPECT_ACTION(packetInfo->packet_bytes >= expected_data_bytes_min, packetBytesRead = 0);

    adjustedPacketInfo = *packetInfo;

    // Only extract what we care about
    if (packetInfo->packet_bytes > expected_data_bytes_max)
    {
        adjustedPacketInfo.packet_bytes = expected_data_bytes_max;
        // Check if the initial portion of the packet received so far exceeds the max value requested.
        if (packetInfo->first_portion_bytes >= expected_data_bytes_max)
        {
            // If we have received more, make sure to copy only the required bytes into the buffer.
            adjustedPacketInfo.first_portion_bytes = expected_data_bytes_max;
            adjustedPacketInfo.p_last_portion_data = nullptr;
        }
    }

    // Copy number of bytes as indicated in `packetInfo->first_portion_bytes` into the buffer.
    sli_ot_radio_interface_rail_copy_rx_packet(buffer, &adjustedPacketInfo);
    // Put it back to packetBytes.
    packetBytesRead = (uint8_t)adjustedPacketInfo.packet_bytes;

exit:
    return packetBytesRead;
}

//------------------------------------------------------------------------------
// Forward Declarations

static void efr32PhyStackInit(void);

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
static void updateIeInfoTxFrame(uint32_t shrTxTime);
#endif

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
static void efr32CoexInit(void);
// Try to transmit the current outgoing frame subject to MAC-level PTA
static void tryTxCurrentPacket(void);
#else
// Transmit the current outgoing frame.
void txCurrentPacket(void);
#define tryTxCurrentPacket txCurrentPacket
#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT

static bool validatePacketDetails(sl_rail_rx_packet_handle_t      packetHandle,
                                  sl_rail_rx_packet_details_t    *pPacketDetails,
                                  const sl_rail_rx_packet_info_t *pPacketInfo,
                                  uint16_t                       *packetLength);
static bool validatePacketTimestamp(sl_rail_rx_packet_details_t *pPacketDetails, uint16_t packetLength);

static void updateRxFrameTimestamp(bool aIsAckFrame, sl_rail_time_t aTimestamp);

