youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
static otError skipRxPacketLengthBytes(sl_rail_rx_packet_info_t *pPacketInfo);

//==============================================================================
// Radio State Management (from radio_state.cpp)
// This section can be extracted to a separate file for future modularization.
// These are timing-critical functions that need to be inline-optimized.
//==============================================================================

// Internal state flags
#define FLAG_RADIO_INIT_DONE 0x00000001
#define FLAG_ONGOING_TX_DATA 0x00000002
#define FLAG_ONGOING_TX_ACK 0x00000004
#define FLAG_WAITING_FOR_ACK 0x00000008
#define FLAG_CURRENT_TX_USE_CSMA 0x00000010
#define FLAG_SCHEDULED_RX_PENDING 0x00000020
#define FLAG_SCHEDULED_TX_PENDING 0x00000040

// Internal state variables
static volatile uint32_t sMiscRadioState = 0;
static bool              sEmPendingData  = false;

// Core flag operations - static inline for internal use only
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static inline void setInternalFlag(uint32_t aFlag, bool aVal)
{
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    sMiscRadioState = (aVal ? (sMiscRadioState | aFlag) : (sMiscRadioState & ~aFlag));
    CORE_EXIT_ATOMIC();
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static inline bool getInternalFlag(uint32_t aFlag)
{
    bool isFlagSet;
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    isFlagSet = (sMiscRadioState & aFlag) ? true : false;
    CORE_EXIT_ATOMIC();

    return isFlagSet;
}

// Public API - these have external linkage for other radio modules
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void sli_ot_radio_state_set_internal_flag(uint32_t aFlag, bool aVal)
{
    setInternalFlag(aFlag, aVal);
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
bool sli_ot_radio_state_get_internal_flag(uint32_t aFlag)
{
    return getInternalFlag(aFlag);
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void sli_ot_radio_state_set_idle(void)
{
    if (sli_ot_radio_interface_rail_get_radio_state() != SL_RAIL_RF_STATE_IDLE)
    {
        sli_ot_radio_interface_rail_idle();
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
        sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_IDLED, 0U);
        sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_IDLED, 0U);
#endif
    }
    sli_ot_radio_interface_rail_yield_radio();
}

// Internal-only wrappers - static inline for ISR performance
static inline bool isTransmitting(void)
{
    return (getInternalFlag(FLAG_ONGOING_TX_DATA) || getInternalFlag(FLAG_ONGOING_TX_ACK));
}

static inline bool isTxDataOngoing(void)
{
    return getInternalFlag(FLAG_ONGOING_TX_DATA);
}

static inline bool hasTxEvents(void)
{
    return getInternalFlag(RADIO_TX_EVENTS);
}

// External API functions - regular linkage for other modules
bool sli_ot_radio_state_is_transmitting(void)
{
    return isTransmitting();
}

bool sli_ot_radio_state_is_transmitting_or_scanning(void)
{
    return (sli_ot_energy_scan_is_in_progress() || isTxDataOngoing() || hasTxEvents());
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
bool sli_ot_radio_state_is_waiting_for_ack(void)
{
    return isTxDataOngoing() && getInternalFlag(FLAG_WAITING_FOR_ACK);
}

bool sli_ot_radio_state_is_tx_scheduled(void)
{
    return getInternalFlag(FLAG_SCHEDULED_TX_PENDING | EVENT_SCHEDULED_TX_STARTED);
}

void sli_ot_radio_state_set_scheduled_rx_pending(bool aPending)
{
    setInternalFlag(FLAG_SCHEDULED_RX_PENDING, aPending);
}

bool sli_ot_radio_state_is_rx_scheduled(void)
{
    return getInternalFlag(FLAG_SCHEDULED_RX_PENDING);
}

void sli_ot_radio_state_set_scheduled_rx_started(bool aStarted)
{
    setInternalFlag(EVENT_SCHEDULED_RX_STARTED, aStarted);
}

bool sli_ot_radio_state_is_initialized(void)
{
    return getInternalFlag(FLAG_RADIO_INIT_DONE);
}

void sli_ot_radio_state_mark_initialized(void)
{
    setInternalFlag(FLAG_RADIO_INIT_DONE, true);
}

bool sli_ot_radio_state_is_tx_data_ongoing(void)
{
    return isTxDataOngoing();
}

void sli_ot_radio_state_set_tx_data_ongoing(bool aOngoing)
{
    setInternalFlag(FLAG_ONGOING_TX_DATA, aOngoing);
}

bool sli_ot_radio_state_is_tx_ack_ongoing(void)
{
    return getInternalFlag(FLAG_ONGOING_TX_ACK);
}

void sli_ot_radio_state_set_tx_ack_ongoing(bool aOngoing)
{
    setInternalFlag(FLAG_ONGOING_TX_ACK, aOngoing);
}

bool sli_ot_radio_state_is_using_csma(void)
{
    return getInternalFlag(FLAG_CURRENT_TX_USE_CSMA);
}

void sli_ot_radio_state_set_using_csma(bool aUseCsma)
{
    setInternalFlag(FLAG_CURRENT_TX_USE_CSMA, aUseCsma);
}

void sli_ot_radio_state_set_waiting_for_ack(bool aWaiting)
{
    setInternalFlag(FLAG_WAITING_FOR_ACK, aWaiting);
}

void sli_ot_radio_state_set_scheduled_tx_pending(bool aPending)
{
    setInternalFlag(FLAG_SCHEDULED_TX_PENDING, aPending);
}

void sli_ot_radio_state_set_scheduled_tx_started(bool aStarted)
{
    setInternalFlag(EVENT_SCHEDULED_TX_STARTED, aStarted);
}

bool sli_ot_radio_state_has_tx_events(void)
{
    return hasTxEvents();
}

void sli_ot_radio_state_clear_all_tx_events(void)
{
    setInternalFlag(RADIO_TX_EVENTS, false);
}

bool sli_ot_radio_state_has_tx_success(void)
{
    return getInternalFlag(EVENT_TX_SUCCESS);
}

void sli_ot_radio_state_set_tx_success(bool aSuccess)
{
    setInternalFlag(EVENT_TX_SUCCESS, aSuccess);
}

bool sli_ot_radio_state_has_tx_cca_failed(void)
{
    return getInternalFlag(EVENT_TX_CCA_FAILED);
}

void sli_ot_radio_state_set_tx_cca_failed(bool aFailed)
{
    setInternalFlag(EVENT_TX_CCA_FAILED, aFailed);
}

bool sli_ot_radio_state_has_tx_no_ack(void)
{
    return getInternalFlag(EVENT_TX_NO_ACK);
}

void sli_ot_radio_state_set_tx_no_ack(bool aNoAck)
{
    setInternalFlag(EVENT_TX_NO_ACK, aNoAck);
}

bool sli_ot_radio_state_has_tx_failed(void)
{
    return getInternalFlag(EVENT_TX_FAILED);
}

void sli_ot_radio_state_set_tx_failed(bool aFailed)
{
    setInternalFlag(EVENT_TX_FAILED, aFailed);
}

void sli_ot_radio_state_clear_tx_data_and_wait_for_ack(void)
{
    setInternalFlag(FLAG_ONGOING_TX_DATA | FLAG_WAITING_FOR_ACK | EVENT_SCHEDULED_TX_STARTED, false);
}

void sli_ot_radio_state_clear_all_scheduled_events(void)
{
    setInternalFlag(FLAG_SCHEDULED_RX_PENDING | FLAG_SCHEDULED_TX_PENDING | EVENT_SCHEDULED_TX_STARTED, false);
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
bool sli_ot_radio_state_is_receiving_frame(void)
{
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
    sl_rail_handle_t railHandle = sli_ot_radio_interface_get_rail_handle();

    return (sl_rail_get_radio_state(railHandle) & SL_RAIL_RF_STATE_RX_ACTIVE) == SL_RAIL_RF_STATE_RX_ACTIVE;
#else
    return false;
#endif
}

void sli_ot_radio_state_set_em_pending_data(bool aPending)
{
    sEmPendingData = aPending;
}

