youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
bool sli_ot_radio_state_get_em_pending_data(void)
{
    return sEmPendingData;
}

void sli_ot_radio_state_init(void)
{
    sMiscRadioState = 0;
    sEmPendingData  = false;
}

void sli_ot_radio_state_deinit(void)
{
    sMiscRadioState = 0;
    sEmPendingData  = false;
}

//==============================================================================
// Radio Event Processing
//==============================================================================

// Internal event state
static sl_rail_events_t sCurrentEventConfig = SL_RAIL_EVENTS_NONE;

// Forward declarations for internal event processing functions
static void processTxPacketSentEvent(void);
static void processTxChannelBusyEvent(void);
static void processTxBlockedEvent(void);
static void processTxUnderflowAbortedEvent(void);
static void processTxCcaEvents(sl_rail_events_t aEvents);
static void processRxPacketReceivedEvent(void);
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
static void processRxSyncDetectedEvent(void);
static void processRxFilterPassedEvent(void);
static void processRxFrameErrorEvent(void);
static void processRxFilteredEvent(void);
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
static void processAckSentEvent(void);
static void processAckAbortedEvent(void);
static void processAckBlockedEvent(void);
static void processScheduledTxEvent(void);
static void processScheduledTxMissedEvent(void);
static void processScheduledRxEvent(void);
static void processScheduledRxEndMissedEvent(void);

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
static void processCoexSignalDetectedEvent(void);
#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT

static void processDataRequestCommandEvent(sl_rail_handle_t aRailHandle);

void sli_ot_radio_events_init(void)
{
    sCurrentEventConfig = SL_RAIL_EVENTS_NONE;
}

void sli_ot_radio_events_deinit(void)
{
    sCurrentEventConfig = SL_RAIL_EVENTS_NONE;
}

void sli_ot_radio_events_update_config(sl_rail_events_t mask, sl_rail_events_t values)
{
    sl_rail_status_t status;
    sl_rail_events_t newEventConfig = (sCurrentEventConfig & ~mask) | (values & mask);

    if (newEventConfig != sCurrentEventConfig)
    {
        sl_rail_handle_t railHandle = sli_ot_radio_interface_get_rail_handle();
        if (railHandle != nullptr)
        {
            status = sl_rail_config_events(railHandle, mask, values);

            if (status != SL_RAIL_STATUS_NO_ERROR)
            {
                otLogWarnPlat("Failed to configure radio events: %lu", status);
            }
            sCurrentEventConfig = newEventConfig;
        }
    }
}

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
sl_rail_util_ieee802154_stack_event_t sli_ot_radio_events_handle_phy_stack_event_with_status(
    sl_rail_util_ieee802154_stack_event_t stackEvent,
    uint32_t                              supplement)
{
    sl_rail_util_ieee802154_stack_event_t status = SL_RAIL_UTIL_IEEE802154_STACK_STATUS_SUCCESS;

    if (phyStackEventIsEnabled())
    {
#ifdef SL_CATALOG_RAIL_MULTIPLEXER_PRESENT
        sl_rail_handle_t railHandle = sli_ot_radio_interface_get_rail_handle();
        otEXPECT_ACTION(railHandle != nullptr, status = SL_RAIL_UTIL_IEEE802154_STACK_STATUS_HOLDOFF);
        status = sl_rail_mux_ieee802154_on_event(railHandle, stackEvent, supplement);
#else
        status = sl_rail_util_ieee802154_on_event(stackEvent, supplement);
#endif
    }

#ifdef SL_CATALOG_RAIL_MULTIPLEXER_PRESENT
exit:
#endif
    return status;
}

void sli_ot_radio_events_handle_phy_stack_event(sl_rail_util_ieee802154_stack_event_t stackEvent, uint32_t supplement)
{
    sli_ot_radio_events_handle_phy_stack_event_with_status(stackEvent, supplement);
}
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

void sli_ot_radio_events_process_callback(sl_rail_handle_t aRailHandle, sl_rail_events_t aEvents)
{
    // Process RX sync detection events first
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
    if (aEvents & (SL_RAIL_EVENT_RX_SYNC_0_DETECT | SL_RAIL_EVENT_RX_SYNC_1_DETECT))
    {
        processRxSyncDetectedEvent();
    }
#endif

    // Process coexistence events
#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
    if (aEvents & SL_RAIL_EVENT_SIGNAL_DETECTED)
    {
        processCoexSignalDetectedEvent();
    }
#endif

    // Process data request command events
    if ((aEvents & SL_RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND)
#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
        && !sl_rail_is_rx_auto_ack_paused(aRailHandle)
#endif
    )
    {
        processDataRequestCommandEvent(aRailHandle);
    }

    // Process RX filter passed events
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
    if (aEvents & SL_RAIL_EVENT_RX_FILTER_PASSED)
    {
        processRxFilterPassedEvent();
    }
#endif

    // Process TX events
    sli_ot_radio_events_process_tx_events(aEvents);

    // Process scheduled events for Thread 1.2+
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    if (sli_ot_radio_state_is_rx_scheduled())
    {
        sli_ot_radio_events_process_scheduled_rx_events(aEvents);
    }
    else
    {
        sli_ot_radio_events_process_scheduled_tx_events(aEvents);
    }
#endif

    // Process RX packet received events
    if (aEvents & SL_RAIL_EVENT_RX_PACKET_RECEIVED)
    {
        processRxPacketReceivedEvent();
    }

    // Process RX error events
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
    if (aEvents & SL_RAIL_EVENT_RX_FRAME_ERROR)
    {
        processRxFrameErrorEvent();
    }

    if (aEvents
        & (SL_RAIL_EVENT_RX_PACKET_ABORTED | SL_RAIL_EVENT_RX_ADDRESS_FILTERED | SL_RAIL_EVENT_RX_FIFO_OVERFLOW))
    {
        processRxFilteredEvent();
    }
#endif

    // Process ACK events
    sli_ot_radio_events_process_ack_events(aEvents);

    if (aEvents & SL_RAIL_EVENT_CONFIG_UNSCHEDULED)
    {
        sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_IDLED, 0U);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailEventConfigUnScheduled++;
#endif
    }

    if (aEvents & SL_RAIL_EVENT_CONFIG_SCHEDULED)
    {
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailEventConfigScheduled++;
#endif
    }

