youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
    if (aEvents & SL_RAIL_EVENT_SCHEDULER_STATUS)
    {
        schedulerEventCallback(aRailHandle);
    }

    if (aEvents & SL_RAIL_EVENT_CAL_NEEDED)
    {
        sl_rail_status_t status;

        status = sl_rail_calibrate(aRailHandle, NULL, SL_RAIL_CAL_ALL_PENDING);
        // Non-RTOS DMP case fails but is unsupported
#if (!defined(SL_CATALOG_BLUETOOTH_PRESENT) || defined(SL_CATALOG_KERNEL_PRESENT))
        // TEMPORARY - this asserts on Mux - OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
        OT_UNUSED_VARIABLE(status);
#else
        OT_UNUSED_VARIABLE(status);
#endif

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailEventCalNeeded++;
#endif
    }

    // scheduled and unscheduled config events happen very often,
    // especially in a DMP situation where there is an active BLE connection.
    // Waking up the OT RTOS task on every one of these occurrences causes
    // a lower priority Serial task to starve and makes it appear like a code lockup
    // There is no reason to wake the OT task for these events!
    if (!(aEvents & SL_RAIL_EVENT_CONFIG_SCHEDULED) && !(aEvents & SL_RAIL_EVENT_CONFIG_UNSCHEDULED))
    {
        otSysEventSignalPending();
    }
}

void sli_ot_radio_events_process_tx_events(sl_rail_events_t aEvents)
{
    if (aEvents & SL_RAIL_EVENT_TX_PACKET_SENT)
    {
        processTxPacketSentEvent();
    }
    else if (aEvents & SL_RAIL_EVENT_TX_CHANNEL_BUSY)
    {
        processTxChannelBusyEvent();
    }
    else if (aEvents & SL_RAIL_EVENT_TX_BLOCKED)
    {
        processTxBlockedEvent();
    }
    else if (aEvents & (SL_RAIL_EVENT_TX_UNDERFLOW | SL_RAIL_EVENT_TX_ABORTED))
    {
        processTxUnderflowAbortedEvent();
    }
    else
    {
        // Process CCA-related events
        processTxCcaEvents(aEvents);
    }
}

void sli_ot_radio_events_process_rx_events(sl_rail_events_t aEvents)
{
    // RX events are processed in the main callback
    // This function is provided for future extensibility
    OT_UNUSED_VARIABLE(aEvents);
}

void sli_ot_radio_events_process_scheduled_tx_events(sl_rail_events_t aEvents)
{
    if (aEvents & SL_RAIL_EVENT_TX_SCHEDULED_TX_STARTED)
    {
        processScheduledTxEvent();
    }
    else if (aEvents & SL_RAIL_EVENT_TX_SCHEDULED_TX_MISSED)
    {
        processScheduledTxMissedEvent();
    }
}

void sli_ot_radio_events_process_scheduled_rx_events(sl_rail_events_t aEvents)
{
    if (aEvents & SL_RAIL_EVENT_RX_SCHEDULED_RX_STARTED)
    {
        processScheduledRxEvent();
    }

    if (aEvents & SL_RAIL_EVENT_RX_SCHEDULED_RX_END || aEvents & SL_RAIL_EVENT_RX_SCHEDULED_RX_MISSED)
    {
        processScheduledRxEndMissedEvent();
    }
}

void sli_ot_radio_events_process_ack_events(sl_rail_events_t aEvents)
{
    if (aEvents & SL_RAIL_EVENT_TXACK_PACKET_SENT)
    {
        processAckSentEvent();
    }

    if (aEvents & (SL_RAIL_EVENT_TXACK_ABORTED | SL_RAIL_EVENT_TXACK_UNDERFLOW))
    {
        processAckAbortedEvent();
    }

    if (aEvents & SL_RAIL_EVENT_TXACK_BLOCKED)
    {
        processAckBlockedEvent();
    }

    // Deal with ACK timeout after possible RX completion in case RAIL
    // notifies us of the ACK and the timeout simultaneously -- we want
    // the ACK to win over the timeout.
    if ((aEvents & SL_RAIL_EVENT_RX_ACK_TIMEOUT) && (sli_ot_radio_state_get_internal_flag(FLAG_WAITING_FOR_ACK)))
    {
        ackTimeoutCallback();
    }
}

void sli_ot_radio_events_process_coex_events(sl_rail_events_t aEvents)
{
    // Coexistence events are processed in the main callback
    // This function is provided for future extensibility
    OT_UNUSED_VARIABLE(aEvents);
}

void sli_ot_radio_events_process_data_request_events(sl_rail_handle_t aRailHandle, sl_rail_events_t aEvents)
{
    if (aEvents & SL_RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND)
    {
        processDataRequestCommandEvent(aRailHandle);
    }
}

void sli_ot_radio_events_process_error_events(sl_rail_events_t aEvents)
{
    // Error events are processed in the main callback
    // This function is provided for future extensibility
    OT_UNUSED_VARIABLE(aEvents);
}

// Internal event processing functions
static inline void processTxPacketSentEvent(void)
{
    packetSentCallback(false);
}

static inline void processTxChannelBusyEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_BLOCKED,
                                               static_cast<uint32_t>(txWaitingForAck()));
    txFailedCallback(false, EVENT_TX_CCA_FAILED);
}

static inline void processTxBlockedEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_BLOCKED,
                                               static_cast<uint32_t>(txWaitingForAck()));
    txFailedCallback(false, EVENT_TX_FAILED);
}

static inline void processTxUnderflowAbortedEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_ABORTED,
                                               static_cast<uint32_t>(txWaitingForAck()));
    txFailedCallback(false, EVENT_TX_FAILED);
}

static inline void processTxCcaEvents(sl_rail_events_t aEvents)
{
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
    if (aEvents & SL_RAIL_EVENT_TX_START_CCA)
    {
        sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_CCA_SOON, 0U);
    }

    if (aEvents & SL_RAIL_EVENT_TX_CCA_RETRY)
    {
        sl_rail_handle_t railHandle = sli_ot_radio_interface_get_rail_handle();
        sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_CCA_BUSY,
                                                   static_cast<uint32_t>(sl_rail_is_next_cca_now(railHandle)));
    }

    if (aEvents & SL_RAIL_EVENT_TX_CHANNEL_CLEAR)
    {
        sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_STARTED, 0U);
    }
#else
    OT_UNUSED_VARIABLE(aEvents);
#endif
}

static inline void processRxPacketReceivedEvent(void)
{
    packetReceivedCallback();
}

