youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
static inline void processRxSyncDetectedEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_STARTED,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_receiving_frame()));
}

static inline void processRxFilterPassedEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ACCEPTED,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_receiving_frame()));
}

static inline void processRxFrameErrorEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_CORRUPTED,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_receiving_frame()));
}

static inline void processRxFilteredEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_FILTERED,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_receiving_frame()));
}
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

static inline void processAckSentEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ACK_SENT,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_receiving_frame()));
    packetSentCallback(true);
}

static inline void processAckAbortedEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ACK_ABORTED,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_receiving_frame()));
    txFailedCallback(true, 0xFF);
}

static inline void processAckBlockedEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ACK_BLOCKED,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_receiving_frame()));
}

static inline void processScheduledTxEvent(void)
{
    sli_ot_radio_state_set_internal_flag(EVENT_SCHEDULED_TX_STARTED, true);
    sli_ot_radio_state_set_internal_flag(FLAG_SCHEDULED_TX_PENDING, false);
}

static inline void processScheduledTxMissedEvent(void)
{
    sli_ot_radio_state_set_internal_flag(FLAG_SCHEDULED_TX_PENDING, false);
    txFailedCallback(false, EVENT_TX_SCHEDULER_ERROR);
}

static inline void processScheduledRxEvent(void)
{
    sli_ot_radio_state_set_internal_flag(EVENT_SCHEDULED_RX_STARTED, true);
}

static inline void processScheduledRxEndMissedEvent(void)
{
    sli_ot_radio_state_set_internal_flag(FLAG_SCHEDULED_RX_PENDING | EVENT_SCHEDULED_RX_STARTED, false);
    sli_ot_radio_state_set_idle();
}

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
static inline void processCoexSignalDetectedEvent(void)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_SIGNAL_DETECTED, 0U);
}
#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT

static inline void processDataRequestCommandEvent(sl_rail_handle_t aRailHandle)
{
    dataRequestCommandCallback(aRailHandle);
}
//==============================================================================

//------------------------------------------------------------------------------
// Helper Functions

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool phyStackEventIsEnabled(void)
{
    bool result = false;

#if (defined(SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT) && SL_RAIL_UTIL_ANT_DIV_RX_RUNTIME_PHY_SELECT)
    result = true;
#endif // SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
    if (sli_ot_radio_interface_is_coex_enabled())
    {
        result |= sl_rail_util_coex_is_enabled();
#ifdef SL_RAIL_UTIL_COEX_RUNTIME_PHY_SELECT
        result |= SL_RAIL_UTIL_COEX_RUNTIME_PHY_SELECT;
#endif
    }
#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT

    return result;
}

#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static inline bool txWaitingForAck(void)
{
    return (sli_ot_radio_state_is_tx_data_ongoing() && sCurrentTxPacket != nullptr
            && ((sCurrentTxPacket->frame.mPsdu[0] & IEEE802154_FRAME_FLAG_ACK_REQUIRED) != 0));
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool txIsDataRequest(void)
{
    bool     isDataRequest = false;
    uint16_t fcf;

    otEXPECT(sli_ot_radio_state_is_tx_data_ongoing() && sCurrentTxPacket != nullptr);

    fcf = (uint16_t)sCurrentTxPacket->frame.mPsdu[IEEE802154_FCF_OFFSET]
          | (uint16_t)(sCurrentTxPacket->frame.mPsdu[IEEE802154_FCF_OFFSET + 1] << 8);

    isDataRequest = ((fcf & IEEE802154_FRAME_TYPE_MASK) == IEEE802154_FRAME_TYPE_COMMAND);

exit:
    return isDataRequest;
}

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
static otError radioScheduleRx(uint8_t aChannel, uint32_t aStart, uint32_t aDuration)
{
    otError          error = OT_ERROR_NONE;
    sl_rail_status_t status;

#if FAST_CHANNEL_SWITCHING_SUPPORT && OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    // UID 1327639: Schedule Rx and Concurrent listening when used together
    // will cause undefined behavior. Therefore it was decided to assert upon detecting
    // this condition
    assert(0);
#endif // FAST_CHANNEL_SWITCHING_SUPPORT && OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE

    sl_rail_scheduler_info_t bgRxSchedulerInfo = {.priority         = SL_802154_RADIO_PRIO_BACKGROUND_RX_VALUE,
                                                  .slip_time        = 0,
                                                  .transaction_time = 0};

    // Configure scheduled receive as requested
    sl_rail_scheduled_rx_config_t rxCfg = {
        .start                      = aStart,
        .start_mode                 = SL_RAIL_TIME_ABSOLUTE,
        .end                        = aDuration,
        .end_mode                   = SL_RAIL_TIME_DELAY,
        .rx_transition_end_schedule = 0, // To stay in schedule Rx state after packet receive.
        .hard_window_end            = 0};           // This lets us receive a packet near a window-end-event

