youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
    status = sli_ot_radio_interface_rail_start_scheduled_rx(aChannel, &rxCfg, &bgRxSchedulerInfo);
    otEXPECT_ACTION(status == SL_RAIL_STATUS_NO_ERROR, error = OT_ERROR_FAILED);

    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_LISTEN, 0U);
exit:
    return error;
}
#endif // (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

template <typename EventCallback> static void efr32ConfigInit(EventCallback aEventCallback)
{
    // Set event callback in common config
    efr32CommonConfig *commonConfig           = sli_ot_radio_interface_get_common_config_ptr();
    commonConfig->mRailConfig.events_callback = aEventCallback;

    sli_init_power_manager();

    OT_ASSERT(sli_ot_radio_interface_rail_init(commonConfig) != nullptr);

    sli_ot_radio_events_update_config(SL_RAIL_EVENTS_ALL,
                                      (0 | SL_RAIL_EVENT_RX_ACK_TIMEOUT | SL_RAIL_EVENT_RX_PACKET_RECEIVED
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
                                       | SL_RAIL_EVENT_TX_SCHEDULED_TX_STARTED | SL_RAIL_EVENT_TX_SCHEDULED_TX_MISSED
                                       | SL_RAIL_EVENT_RX_SCHEDULED_RX_STARTED | SL_RAIL_EVENT_RX_SCHEDULED_RX_END
                                       | SL_RAIL_EVENT_RX_SCHEDULED_RX_MISSED
#endif
                                       | SL_RAIL_EVENTS_TXACK_COMPLETION | SL_RAIL_EVENTS_TX_COMPLETION
                                       | SL_RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT || RADIO_CONFIG_DMP_SUPPORT
                                       | SL_RAIL_EVENT_CONFIG_SCHEDULED | SL_RAIL_EVENT_CONFIG_UNSCHEDULED
                                       | SL_RAIL_EVENT_SCHEDULER_STATUS
#endif
                                       | SL_RAIL_EVENT_CAL_NEEDED));

    sli_ot_radio_interface_load_rail_config(sli_ot_radio_interface_get_band_config_ptr(),
                                            OPENTHREAD_CONFIG_DEFAULT_TRANSMIT_POWER);
}

void efr32RadioInit(void)
{
    if (sli_ot_radio_state_is_initialized())
    {
        return;
    }
    sl_rail_status_t            status;
    sl_status_t                 rxMemPoolStatus;
    bool                        queueStatus;
    sl_rail_timer_sync_config_t timer_sync_config = SL_RAIL_TIMER_SYNC_DEFAULT;

    // check if RAIL_TX_FIFO_SIZE is power of two..
    OT_ASSERT((RAIL_TX_FIFO_SIZE & (RAIL_TX_FIFO_SIZE - 1)) == 0);

    // check the limits of the RAIL_TX_FIFO_SIZE.
    OT_ASSERT((RAIL_TX_FIFO_SIZE >= SL_RAIL_MINIMUM_FIFO_BYTES) || (RAIL_TX_FIFO_SIZE <= SL_RAIL_MAXIMUM_FIFO_BYTES));

    sli_ot_radio_events_init();
    sli_ot_radio_interface_init_config();
    efr32ConfigInit(sli_ot_radio_events_process_callback);
    sli_ot_radio_state_mark_initialized();
    status = sli_ot_radio_interface_rail_config_sleep(&timer_sync_config);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

    sReceive.frame.mLength = 0;
    sReceive.frame.mPsdu   = nullptr;

    sReceiveAck.frame.mLength = 0;
    sReceiveAck.frame.mPsdu   = sReceiveAckPsdu;

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    sli_ot_radio_instance_init_command_queue();
#endif

    for (uint8_t i = 0; i < RADIO_REQUEST_BUFFER_COUNT; i++)
    {
        // Initialize the tx buffer params.
        sTransmitBuffer[i].instance      = nullptr;
        sTransmitBuffer[i].frame.mLength = 0;
        sTransmitBuffer[i].frame.mPsdu   = sTransmitPsdu[i];

#if OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT
        sTransmitBuffer[i].frame.mInfo.mTxInfo.mIeInfo = &sTransmitIeInfo[i];
#endif
    }

#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
    otLinkMetricsInit(SL_OPENTHREAD_RECEIVE_SENSITIVITY);
#endif
    sli_ot_radio_interface_set_current_band_config(
        sli_ot_radio_interface_get_band_config(OPENTHREAD_CONFIG_DEFAULT_CHANNEL));
    OT_ASSERT(sli_ot_radio_interface_get_current_band_config() != nullptr);

    sl_rail_util_pa_init();
    sli_ot_radio_interface_set_tx_power(OPENTHREAD_CONFIG_DEFAULT_TRANSMIT_POWER);

    status = sli_ot_radio_interface_rail_config_rx_options(SL_RAIL_RX_OPTION_TRACK_ABORTED_FRAMES,
                                                           SL_RAIL_RX_OPTION_TRACK_ABORTED_FRAMES);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
    efr32PhyStackInit();
    sli_ot_radio_interface_set_cca_mode(SL_OPENTHREAD_RADIO_CCA_MODE);

    sli_ot_energy_scan_init();

#if FAST_CHANNEL_SWITCHING_SUPPORT && OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    sli_ot_radio_channel_switching_init();
#endif

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    sli_ot_radio_csl_init();
#endif

    // Initialize the queue for received packets.
    queueStatus = queueInit(&sRxPacketQueue, SL_OPENTHREAD_RADIO_RX_BUFFER_COUNT);
    OT_ASSERT(queueStatus);

    // Specify a callback to be called upon queue overflow.
    queueStatus = queueOverflow(&sRxPacketQueue, &rxPacketQueueOverflowCallback);
    OT_ASSERT(queueStatus);

    // Initialize the memory pool for rx packets.
    rxMemPoolStatus =
        sl_memory_create_pool(sizeof(rxBuffer), SL_OPENTHREAD_RADIO_RX_BUFFER_COUNT, &sRxPacketMemPoolHandle);
    OT_ASSERT(rxMemPoolStatus == SL_STATUS_OK);

    otLogInfoPlat("Initialized");
}

void efr32RadioDeinit(void)
{
    sl_rail_status_t status;

    sli_ot_radio_interface_rail_idle_abort();
    status = sli_ot_radio_interface_rail_config_events(SL_RAIL_EVENTS_ALL, 0);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

    sli_ot_radio_interface_set_current_band_config(nullptr);
    sli_ot_radio_events_deinit();

    // Clean up any ongoing energy scan
    sli_ot_energy_scan_deinit();

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    sli_ot_radio_csl_deinit();
#endif

    sl_memory_delete_pool(&sRxPacketMemPoolHandle);
}

//------------------------------------------------------------------------------
// Stack support

void otPlatRadioSetPanId(otInstance *aInstance, uint16_t aPanId)
{
    sl_rail_status_t status;
    panIndex_t       panIndex = sli_ot_radio_instance_get_pan_index(aInstance);

    otEXPECT(sl_ot_rtos_task_can_access_pal());
    otLogInfoPlat("PANID=%X index=%u", aPanId, panIndex);
    utilsSoftSrcMatchSetPanId(aInstance, aPanId);

