youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
    status = sli_ot_radio_interface_rail_set_pan_id(aPanId, panIndex);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    sli_ot_radio_instance_update_rail_filter_mask_for_pan_id(aPanId, panIndex);
#endif
exit:
    return;
}

void otPlatRadioSetExtendedAddress(otInstance *aInstance, const otExtAddress *aAddress)
{
    sl_rail_status_t status;
    panIndex_t       panIndex = sli_ot_radio_instance_get_pan_index(aInstance);

    otEXPECT(sl_ot_rtos_task_can_access_pal());

    for (size_t i = 0; i < sizeof(*aAddress); i++)
    {
        sExtAddress[panIndex].m8[i] = aAddress->m8[sizeof(*aAddress) - 1 - i];
    }

    otLogInfoPlat("ExtAddr=%X%X%X%X%X%X%X%X index=%u",
                  aAddress->m8[7],
                  aAddress->m8[6],
                  aAddress->m8[5],
                  aAddress->m8[4],
                  aAddress->m8[3],
                  aAddress->m8[2],
                  aAddress->m8[1],
                  aAddress->m8[0],
                  panIndex);

    status = sli_ot_radio_interface_rail_set_long_address((const uint8_t *)aAddress->m8, panIndex);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

exit:
    return;
}

void otPlatRadioSetShortAddress(otInstance *aInstance, uint16_t aAddress)
{
    sl_rail_status_t status;
    panIndex_t       panIndex = sli_ot_radio_instance_get_pan_index(aInstance);

    otEXPECT(sl_ot_rtos_task_can_access_pal());
    otLogInfoPlat("ShortAddr=%X index=%u", aAddress, panIndex);

    status = sli_ot_radio_interface_rail_set_short_address(aAddress, panIndex);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

exit:
    return;
}

otError otPlatRadioEnable(otInstance *aInstance)
{
    otError error = OT_ERROR_NONE;

    otEXPECT(!otPlatRadioIsEnabled(aInstance));

    otLogInfoPlat("State=OT_RADIO_STATE_SLEEP");

exit:
    return error;
}

otError otPlatRadioDisable(otInstance *aInstance)
{
    otError error = OT_ERROR_NONE;

    otEXPECT_ACTION(sl_ot_rtos_task_can_access_pal(), error = OT_ERROR_REJECTED);
    otEXPECT_ACTION(otPlatRadioIsEnabled(aInstance), error = OT_ERROR_INVALID_STATE);

    otLogInfoPlat("State=OT_RADIO_STATE_DISABLED");

exit:
    return error;
}

otError otPlatRadioReceive(otInstance *aInstance, uint8_t aChannel)
{
    otError          error = OT_ERROR_NONE;
    sl_rail_status_t status;
    int8_t           txPower;

    otEXPECT_ACTION(sl_ot_rtos_task_can_access_pal(), error = OT_ERROR_REJECTED);
    otEXPECT_ACTION(!sli_ot_radio_state_is_tx_data_ongoing() && !sli_ot_energy_scan_is_blocking_receive(aInstance),
                    error = OT_ERROR_INVALID_STATE);

#if (FAST_CHANNEL_SWITCHING_SUPPORT && OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE)
    sli_ot_radio_channel_switching_configure(aInstance, aChannel);
#endif

    txPower = sl_get_tx_power_for_current_channel(aInstance);
    error   = sli_ot_radio_interface_load_channel_config(aChannel, txPower);
    otEXPECT(error == OT_ERROR_NONE);

    status = sli_ot_radio_interface_set_rx(aChannel);
    otEXPECT_ACTION(status == SL_RAIL_STATUS_NO_ERROR, error = OT_ERROR_FAILED);
    sli_ot_radio_state_set_scheduled_rx_pending(false);

    sReceive.frame.mChannel    = aChannel;
    sReceiveAck.frame.mChannel = aChannel;

exit:
    return error;
}

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
otError otPlatRadioReceiveAt(otInstance *aInstance, uint8_t aChannel, uint32_t aStart, uint32_t aDuration)
{
    otError error   = OT_ERROR_NONE;
    int8_t  txPower = sl_get_tx_power_for_current_channel(aInstance);

    // We can only have one schedule request i.e. either Rx or Tx as they use the
    // same RAIL resources.
    otEXPECT_ACTION(!sli_ot_radio_state_is_tx_scheduled(), error = OT_ERROR_FAILED);

    otEXPECT_ACTION(sl_ot_rtos_task_can_access_pal(), error = OT_ERROR_REJECTED);
    OT_UNUSED_VARIABLE(aInstance);

    error = sli_ot_radio_interface_load_channel_config(aChannel, txPower);
    otEXPECT(error == OT_ERROR_NONE);

    // Set the flag first and then schedule the Rx as the rail scheduler can trigger the events even before
    // sl_rail_start_scheduled_rx() API returns the status if start time is too close to the current time which could
    // otherwise cause the race condition.
    sli_ot_radio_state_set_scheduled_rx_pending(true);
    error = radioScheduleRx(aChannel, aStart, aDuration);
    otEXPECT_ACTION(error == OT_ERROR_NONE, sli_ot_radio_state_set_scheduled_rx_pending(false));

    // Set channel for global receive state
    sReceive.frame.mChannel    = aChannel;
    sReceiveAck.frame.mChannel = aChannel;

exit:
    return error;
}
#endif // (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

otError otPlatRadioTransmit(otInstance *aInstance, otRadioFrame *aFrame)
{
    otError         error      = OT_ERROR_NONE;
    int8_t          txPower    = sl_get_tx_power_for_current_channel(aInstance);
    instanceIndex_t txBufIndex = sli_ot_radio_instance_get_index(aInstance);

    otEXPECT_ACTION(sl_ot_rtos_task_can_access_pal(), error = OT_ERROR_REJECTED);

#if OPENTHREAD_CONFIG_MULTIPAN_RCP_ENABLE
    // Accept GP packets even if radio is not in required state.
    if ((sl_gp_intf_get_state() != SL_GP_STATE_SEND_RESPONSE) && sl_gp_intf_should_buffer_pkt(aInstance, aFrame, false))
    {
        sl_gp_intf_buffer_pkt(aInstance);
    }
    else
#endif
    {
        OT_ASSERT(txBufIndex < RADIO_REQUEST_BUFFER_COUNT);
        OT_ASSERT(aFrame == &sTransmitBuffer[txBufIndex].frame);
        OT_ASSERT(aFrame->mPsdu == sTransmitPsdu[txBufIndex]);

        if (!aFrame->mInfo.mTxInfo.mIsARetx)
        {
            sTransmitBuffer[txBufIndex].currentRadioTxPriority = SL_802154_RADIO_PRIO_TX_MIN;
        }
        else if (sTransmitBuffer[txBufIndex].currentRadioTxPriority > SL_802154_RADIO_PRIO_TX_STEP)
        {
            sTransmitBuffer[txBufIndex].currentRadioTxPriority -= SL_802154_RADIO_PRIO_TX_STEP;
        }
        // TX priority is always bounded by the maximum priority configured
        if (sTransmitBuffer[txBufIndex].currentRadioTxPriority < SL_802154_RADIO_PRIO_TX_MAX)
        {
            sTransmitBuffer[txBufIndex].currentRadioTxPriority = SL_802154_RADIO_PRIO_TX_MAX;
        }

