youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
        // Push pending transmit and exit if radio is busy.
        if (sli_ot_radio_state_is_transmitting_or_scanning())
        {
            sli_ot_radio_instance_queue_transmit(aInstance, aFrame);
            ExitNow(error = OT_ERROR_NONE);
        }
#endif
        error = sli_ot_radio_interface_load_channel_config(aFrame->mChannel, txPower);
        otEXPECT(error == OT_ERROR_NONE);

        OT_ASSERT(!sli_ot_radio_state_is_tx_data_ongoing());

        sli_ot_radio_state_clear_all_tx_events();
        sTransmitBuffer[txBufIndex].instance = aInstance;
        sCurrentTxPacket                     = &sTransmitBuffer[txBufIndex];

        sli_ot_radio_state_set_using_csma(aFrame->mInfo.mTxInfo.mCsmaCaEnabled);

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
        sli_ot_radio_csl_set_present(aInstance, aFrame->mInfo.mTxInfo.mCslPresent);
#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
        if (sli_ot_radio_csl_get_period(aInstance) > 0 && sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay == 0)
        {
            // Only called for CSL children (CSL period > 0)
            // Note: Our SSEDs "schedule" transmissions to their parent in order to know
            // exactly when in the future the data packets go out so they can calculate
            // the accurate CSL phase to send to their parent.
            sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelayBaseTime = sl_rail_get_time(SL_RAIL_EFR32_HANDLE);
            sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay =
                SCHEDULE_TX_DELAY_US; // Chosen after internal certification testing
            sli_ot_radio_csl_set_present(aInstance, true);
        }
#endif
        updateIeInfoTxFrame(sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelayBaseTime
                            + sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay + SHR_DURATION_US);

        // Note - we need to call this outside of txCurrentPacket as for Series 2,
        // this results in calling the SE interface from a critical section which is not permitted.
        (void)sli_ot_radio_security_process_transmit(&sCurrentTxPacket->frame, sCurrentTxPacket->instance);
#endif // OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2

        CORE_DECLARE_IRQ_STATE;
        CORE_ENTER_ATOMIC();
        sli_ot_radio_state_set_tx_data_ongoing(true);
        tryTxCurrentPacket();
        CORE_EXIT_ATOMIC();

        if (sli_ot_radio_state_has_tx_failed())
        {
            otPlatRadioTxStarted(aInstance, aFrame);
        }
    }
exit:
    return error;
}

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void updateIeInfoTxFrame(uint32_t shrTxTime)
{
    OT_ASSERT(sCurrentTxPacket != nullptr);

#if OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT && OPENTHREAD_CONFIG_TIME_SYNC_ENABLE
    // Seek the time sync offset and update the rendezvous time
    if (sCurrentTxPacket->frame.mInfo.mTxInfo.mIeInfo->mTimeIeOffset != 0)
    {
        uint8_t *timeIe = sCurrentTxPacket->frame.mPsdu + sCurrentTxPacket->frame.mInfo.mTxInfo.mIeInfo->mTimeIeOffset;
        uint64_t time   = otPlatTimeGet();

        // Use the same mechanism as CSL children to schedule tx for the future without CSMA
        // so that the value written to the time IE exactly matches the actual tx time of the packet
        sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelayBaseTime =
            (uint32_t)time; // Bottom 32 bits are sl_rail_get_time()
        sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay = SCHEDULE_TX_DELAY_US;
        time += sCurrentTxPacket->frame.mInfo.mTxInfo.mIeInfo->mNetworkTimeOffset
                + sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay + SHR_DURATION_US;
        *timeIe = sCurrentTxPacket->frame.mInfo.mTxInfo.mIeInfo->mTimeSyncSeq;

        *(++timeIe) = (uint8_t)(time & 0xff);
        for (uint8_t i = 1; i < sizeof(uint64_t); i++)
        {
            time        = time >> 8;
            *(++timeIe) = (uint8_t)(time & 0xff);
        }
    }
#endif // OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT && OPENTHREAD_CONFIG_TIME_SYNC_ENABLE

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    // Update IE data in the 802.15.4 header with the newest CSL period / phase
    otInstance *instance = sCurrentTxPacket->instance;
    if (sli_ot_radio_csl_get_period(instance) > 0 && !sCurrentTxPacket->frame.mInfo.mTxInfo.mIsHeaderUpdated)
    {
        otMacFrameSetCslIe(&sCurrentTxPacket->frame,
                           (uint16_t)sli_ot_radio_csl_get_period(instance),
                           sli_ot_radio_csl_get_phase(instance, shrTxTime));
    }
#else
    OT_UNUSED_VARIABLE(shrTxTime);
#endif // OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
}
#endif // OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2

void txCurrentPacket(void)
{
    OT_ASSERT(sli_ot_radio_state_is_tx_data_ongoing());
    OT_ASSERT(sCurrentTxPacket != nullptr);

    sl_rail_tx_options_t txOptions = SL_RAIL_TX_OPTIONS_DEFAULT;
    sl_rail_status_t     status    = SL_RAIL_STATUS_INVALID_STATE;
    uint8_t              frameLength;
    bool                 ackRequested;

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    railDebugCounters.mRailPlatTxTriggered++;
#endif
    // signalling this event earlier, as this event can OT_ASSERT REQ (expecially for a
    // non-CSMA transmit) giving the Coex master a little more time to grant or deny.
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_PENDED_PHY,
                                               static_cast<uint32_t>(sli_ot_radio_state_is_using_csma()));

    frameLength = (uint8_t)sCurrentTxPacket->frame.mLength;

    if (PHY_HEADER_SIZE == 1)
    {
        sli_ot_radio_interface_rail_write_tx_fifo(&frameLength, sizeof frameLength, true);
    }
    else
    { // 2 byte PHR for Sub-GHz
        uint8_t PHRByte1 = (0x08U /*FCS=2byte*/ | 0x10U /*Whiten=enabled*/);
        uint8_t PHRByte2 = (uint8_t)(__RBIT(frameLength) >> 24);

