youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
        sli_ot_radio_interface_rail_write_tx_fifo(&PHRByte1, sizeof PHRByte1, true);
        sli_ot_radio_interface_rail_write_tx_fifo(&PHRByte2, sizeof PHRByte2, false);
    }
    sli_ot_radio_interface_rail_write_tx_fifo(sCurrentTxPacket->frame.mPsdu, frameLength - 2, false);

    sl_rail_scheduler_info_t txSchedulerInfo = {
        .priority         = sCurrentTxPacket->currentRadioTxPriority,
        .slip_time        = RADIO_SCHEDULER_CHANNEL_SLIP_TIME,
        .transaction_time = 0 // will be calculated later if DMP is used
    };

    ackRequested = (sCurrentTxPacket->frame.mPsdu[0] & IEEE802154_FRAME_FLAG_ACK_REQUIRED);
    if (ackRequested)
    {
        txOptions |= SL_RAIL_TX_OPTION_WAIT_FOR_ACK;

#if RADIO_CONFIG_DMP_SUPPORT
        // time we wait for ACK
        if (sli_ot_radio_interface_rail_get_symbol_rate() > 0)
        {
            txSchedulerInfo.transaction_time +=
                (sl_rail_time_t)(12 * 1e6 / sli_ot_radio_interface_rail_get_symbol_rate());
        }
        else
        {
            txSchedulerInfo.transaction_time += 12 * RADIO_TIMING_DEFAULT_SYMBOLTIME_US;
        }
#endif
    }

#ifdef SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT
    // Update Tx options to use currently-selected antenna.
    // If antenna diverisity on Tx is disabled, leave both options 0
    // so Tx antenna tracks Rx antenna.
    if (sl_rail_util_ant_div_get_tx_antenna_mode() != SL_RAIL_UTIL_ANT_DIV_DISABLED)
    {
        txOptions |= ((sl_rail_util_ant_div_get_tx_antenna_selected() == SL_RAIL_UTIL_ANTENNA_SELECT_ANTENNA1)
                          ? SL_RAIL_TX_OPTION_ANTENNA_0
                          : SL_RAIL_TX_OPTION_ANTENNA_1);
    }
#endif // SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT

#if RADIO_CONFIG_DMP_SUPPORT
    // time needed for the frame itself
    // 4B preamble, 1B SFD, 1B PHR is not counted in frameLength
    if (sli_ot_radio_interface_rail_get_bit_rate() > 0)
    {
        txSchedulerInfo.transaction_time +=
            (sl_rail_time_t)((frameLength + 4 + 1 + 1) * 8 * 1e6 / sli_ot_radio_interface_rail_get_bit_rate());
    }
    else
    { // assume 250kbps
        txSchedulerInfo.transaction_time += (frameLength + 4 + 1 + 1) * RADIO_TIMING_DEFAULT_BYTETIME_US;
    }
#endif

    // Prioritize the Tx over schedule Rx to avoid missing data check-ins such as data polls.
    if (sli_ot_radio_state_is_rx_scheduled())
    {
        sli_ot_radio_interface_rail_idle();
        sli_ot_radio_state_set_scheduled_rx_pending(false);
        sli_ot_radio_state_set_scheduled_rx_started(false);
    }

    if (sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay == 0)
    {
        if (sli_ot_radio_state_is_using_csma())
        {
#if RADIO_CONFIG_DMP_SUPPORT
            // time needed for CSMA/CA
            txSchedulerInfo.transaction_time += RADIO_TIMING_CSMA_OVERHEAD_US;
#endif
            csmaConfig.csma_tries        = sCurrentTxPacket->frame.mInfo.mTxInfo.mMaxCsmaBackoffs;
            csmaConfig.cca_threshold_dbm = sli_ot_radio_interface_get_cca_threshold();

            status = sli_ot_radio_interface_rail_start_cca_csma_tx(sCurrentTxPacket->frame.mChannel,
                                                                   txOptions,
                                                                   &csmaConfig,
                                                                   &txSchedulerInfo);
        }
        else
        {
            status =
                sli_ot_radio_interface_rail_start_tx(sCurrentTxPacket->frame.mChannel, txOptions, &txSchedulerInfo);
        }

        if (status == SL_RAIL_STATUS_NO_ERROR)
        {
            sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_STARTED, 0U);
        }
    }
    else
    {
        // For CSL transmitters (FTDs):
        // mTxDelayBaseTime = rx-timestamp (end of sync word) when we received CSL-sync with IEs
        // mTxDelay = Delay starting from mTxDelayBaseTime
        //
        // For CSL receivers (SSEDs):
        // mTxDelayBaseTime = timestamp when otPlatRadioTransmit is called
        // mTxDelay = Chosen value in the future where transmit is scheduled, so we know exactly
        // when to calculate the phase (we can't do this on-the-fly as the packet is going out
        // due to platform limitations.  see radioScheduleRx)
        //
        // Note that both use single CCA config, overriding any CCA/CSMA configs from the stack
        //
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
        sl_rail_scheduled_tx_config_t scheduleTxOptions = {
            .when = sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelayBaseTime
                    + sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay - SHR_DURATION_US,
            .mode         = SL_RAIL_TIME_ABSOLUTE,
            .tx_during_rx = SL_RAIL_SCHEDULED_TX_DURING_RX_POSTPONE_TX};

        // Set ccaBackoff to some constant value, so we have predictable radio warmup time for schedule tx.
        cslCsmaConfig.cca_backoff_us = CSL_CSMA_BACKOFF_TIME_IN_US;
        scheduleTxOptions.when -= cslCsmaConfig.cca_backoff_us;

        // CSL transmissions don't use CSMA but MAC accounts for single CCA time.
        // cslCsmaConfig is set to SL_RAIL_CSMA_CONFIG_SINGLE_CCA above.
        status = sli_ot_radio_interface_rail_start_scheduled_cca_csma_tx(sCurrentTxPacket->frame.mChannel,
                                                                         txOptions,
                                                                         &scheduleTxOptions,
                                                                         &cslCsmaConfig,
                                                                         &txSchedulerInfo);

        if (status == SL_RAIL_STATUS_NO_ERROR)
        {
            sli_ot_radio_state_set_scheduled_tx_pending(true);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
            railDebugCounters.mRailEventsScheduledTxTriggeredCount++;
#endif
            sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_STARTED, 0U);
        }
#endif
    }

    if (status == SL_RAIL_STATUS_NO_ERROR)
    {
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailTxStarted++;
#endif
    }
    else
    {
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailTxStartFailed++;
#endif
        sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_BLOCKED,
                                                   static_cast<uint32_t>(ackRequested));
        txFailedCallback(false, EVENT_TX_FAILED);

        otSysEventSignalPending();
    }
}

// This API gets called from init procedure so instance to IID mapping does not exist
// at that point. Also this api will get called sequentially so assign new transmit
// buffer for the given instance.
otRadioFrame *otPlatRadioGetTransmitBuffer(otInstance *aInstance)
{
    uint8_t       index       = 0;
    otRadioFrame *aRadioFrame = nullptr;

    otEXPECT(sl_ot_rtos_task_can_access_pal());

