youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    index = otInstanceGetIndex(aInstance);
#else
    // In single-instance mode, always use index 0
    OT_UNUSED_VARIABLE(aInstance);
#endif

    aRadioFrame = &sTransmitBuffer[index].frame;

exit:
    return aRadioFrame;
}

int8_t otPlatRadioGetRssi(otInstance *aInstance)
{
    int8_t  rssi    = OT_RADIO_RSSI_INVALID;
    uint8_t channel = sReceive.frame.mChannel;

    otEXPECT(sl_ot_rtos_task_can_access_pal());
    otEXPECT(!sli_ot_radio_state_is_tx_data_ongoing());

#if (FAST_CHANNEL_SWITCHING_SUPPORT && OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE)
    channel = sli_ot_radio_channel_switching_get_channel(aInstance);
#endif

    sli_ot_energy_scan(aInstance, channel, SL_OPENTHREAD_RSSI_AVERAGING_TIME, &rssi);

exit:
    return rssi;
}

otError otPlatRadioSetTransmitPower(otInstance *aInstance, int8_t aPower)
{
    return sli_set_default_tx_power(aInstance, aPower);
}

// Required for RCP error recovery
// See src/lib/spinel/radio_spinel.cpp::RestoreProperties()
otError otPlatRadioSetChannelMaxTransmitPower(otInstance *aInstance, uint8_t aChannel, int8_t aMaxPower)
{
    return sli_set_channel_max_tx_power(aInstance, aChannel, aMaxPower);
}

otError otPlatRadioEnergyScan(otInstance *aInstance, uint8_t aScanChannel, uint16_t aScanDuration)
{
    otError error       = OT_ERROR_NONE;
    bool    shouldDefer = false;

    otEXPECT_ACTION(sl_ot_rtos_task_can_access_pal(), error = OT_ERROR_REJECTED);

    shouldDefer = sli_ot_radio_instance_energy_scan_should_defer();
    otEXPECT_ACTION(!shouldDefer, sli_ot_radio_instance_energy_scan_defer(aInstance, aScanChannel, aScanDuration));

    error = sli_ot_energy_scan_status_to_ot_error(
        sli_ot_energy_scan_async(aInstance, aScanChannel, (sl_rail_time_t)aScanDuration * US_IN_MS));

exit:
    return error;
}

//------------------------------------------------------------------------------
// Radio Config: Thread 1.2 transmit security support

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
void otPlatRadioSetMacKey(otInstance             *aInstance,
                          uint8_t                 aKeyIdMode,
                          uint8_t                 aKeyId,
                          const otMacKeyMaterial *aPrevKey,
                          const otMacKeyMaterial *aCurrKey,
                          const otMacKeyMaterial *aNextKey,
                          otRadioKeyType          aKeyType)
{
    sli_ot_radio_security_set_mac_key(aInstance, aKeyIdMode, aKeyId, aPrevKey, aCurrKey, aNextKey, aKeyType);
}

void otPlatRadioSetMacFrameCounter(otInstance *aInstance, uint32_t aMacFrameCounter)
{
    sli_ot_radio_security_set_mac_frame_counter(aInstance, aMacFrameCounter);
}

void otPlatRadioSetMacFrameCounterIfLarger(otInstance *aInstance, uint32_t aMacFrameCounter)
{
    sli_ot_radio_security_set_mac_frame_counter_if_larger(aInstance, aMacFrameCounter);
}
#endif // (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
//------------------------------------------------------------------------------
// Radio implementation: Enhanced ACKs, CSL

// Return false if we should generate an immediate ACK
// Return true otherwise
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool writeIeee802154EnhancedAck(sl_rail_handle_t          aRailHandle,
                                       sl_rail_rx_packet_info_t *packetInfoForEnhAck,
                                       uint32_t                  rxTimestamp,
                                       uint8_t                  *initialPktReadBytes,
                                       uint8_t                  *receivedPsdu)
{
    // RAIL will generate an Immediate ACK for us.
    // For an Enhanced ACK, we need to generate the whole packet ourselves.

    // An 802.15.4 packet from RAIL should look like:
    // 1/2 |   1/2  | 0/1  |  0/2   | 0/2/8  |  0/2   | 0/2/8  |   14
    // PHR | MacFCF | Seq# | DstPan | DstAdr | SrcPan | SrcAdr | SecHdr

    // With sl_rail_ieee802154_enable_early_frame_pending(), SL_RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND
    // is triggered after receiving through the SrcAdr field of Version 0/1 packets,
    // and after receiving through the SecHdr for Version 2 packets.

    otRadioFrame receivedFrame, enhAckFrame;
    uint8_t      enhAckPsdu[IEEE802154_MAX_LENGTH];

#define EARLY_FRAME_PENDING_EXPECTED_BYTES (2U + 2U + 1U + 2U + 8U + 2U + 8U + 14U)
#define FINAL_PACKET_LENGTH_WITH_IE (EARLY_FRAME_PENDING_EXPECTED_BYTES + OT_ACK_IE_MAX_SIZE)

    otMacAddress     aSrcAddress;
    uint8_t          linkMetricsDataLen;
    uint8_t         *dataPtr;
    bool             setFramePending;
    uint8_t         *macFcfPointer;
    otInstance      *instance = nullptr;
    sl_rail_status_t enhAckStatus;

    otEXPECT((packetInfoForEnhAck != nullptr) && (initialPktReadBytes != nullptr) && (receivedPsdu != nullptr));

    *initialPktReadBytes = readInitialPacketData(packetInfoForEnhAck,
                                                 EARLY_FRAME_PENDING_EXPECTED_BYTES,
                                                 (PHY_HEADER_SIZE + 2),
                                                 receivedPsdu,
                                                 FINAL_PACKET_LENGTH_WITH_IE);

    if (*initialPktReadBytes == 0U)
    {
        return true; // Nothing to read, which means generating an immediate ACK is also pointless
    }

    receivedFrame.mPsdu = receivedPsdu + PHY_HEADER_SIZE;
    // This should be set to the expected length of the packet is being received.
    // We consider this while calculating the phase value below.
    receivedFrame.mLength = packetInfoForEnhAck->p_first_portion_data[0];
    enhAckFrame.mPsdu     = enhAckPsdu + PHY_HEADER_SIZE;

    if (!otMacFrameIsVersion2015(&receivedFrame))
    {
        return false;
    }

    linkMetricsDataLen = 0;
    dataPtr            = nullptr;
    setFramePending    = false;

    instance = sli_ot_radio_instance_from_filter_mask(packetInfoForEnhAck->filter_mask);

    (void)otMacFrameGetSrcAddr(&receivedFrame, &aSrcAddress);

    if (instance != nullptr && sli_ot_radio_interface_is_src_match_enabled()
        && (aSrcAddress.mType != OT_MAC_ADDRESS_TYPE_NONE))
    {
        setFramePending = (aSrcAddress.mType == OT_MAC_ADDRESS_TYPE_EXTENDED
                               ? (utilsSoftSrcMatchExtFindEntry(instance, &aSrcAddress.mAddress.mExtAddress) >= 0)
                               : (utilsSoftSrcMatchShortFindEntry(instance, aSrcAddress.mAddress.mShortAddress) >= 0));
    }

    // Generate our IE header.
    // Write IE data for enhanced ACK (link metrics + allocate bytes for CSL)

#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
    uint8_t linkMetricsData[OT_ENH_PROBING_IE_DATA_MAX_SIZE];

