youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
    linkMetricsDataLen = otLinkMetricsEnhAckGenData(&aSrcAddress, sLastLqi, sLastRssi, linkMetricsData);

    if (linkMetricsDataLen > 0)
    {
        dataPtr = linkMetricsData;
    }
#endif

    sAckIeDataLength = generateAckIeData(instance, dataPtr, linkMetricsDataLen, &receivedFrame);

    otEXPECT(otMacFrameGenerateEnhAck(&receivedFrame, setFramePending, sAckIeData, sAckIeDataLength, &enhAckFrame)
             == OT_ERROR_NONE);

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    sli_ot_radio_csl_update_enh_ack_ie(instance,
                                       &enhAckFrame,
                                       rxTimestamp,
                                       packetInfoForEnhAck->packet_bytes,
                                       receivedFrame.mLength);
#else
    OT_UNUSED_VARIABLE(rxTimestamp);
#endif

    if (otMacFrameIsSecurityEnabled(&enhAckFrame))
    {
        otEXPECT(sli_ot_radio_security_process_transmit(&enhAckFrame, instance) == OT_ERROR_NONE);
    }

    // Before we're done, store some important info in reserved bits in the
    // MAC header (cleared later)
    // Check whether frame pending is set.
    // Check whether enhanced ACK is secured.
    otEXPECT((skipRxPacketLengthBytes(packetInfoForEnhAck)) == OT_ERROR_NONE);
    macFcfPointer = ((packetInfoForEnhAck->first_portion_bytes == 0) ? packetInfoForEnhAck->p_last_portion_data
                                                                     : packetInfoForEnhAck->p_first_portion_data);

    if (otMacFrameIsSecurityEnabled(&enhAckFrame))
    {
        *macFcfPointer |= IEEE802154_SECURED_OUTGOING_ENHANCED_ACK;
    }

    if (setFramePending)
    {
        *macFcfPointer |= IEEE802154_FRAME_PENDING_SET_IN_OUTGOING_ACK;
    }

    // Fill in PHR now that we know Enh-ACK's length
    if (PHY_HEADER_SIZE == 2U)
    { // Not true till SubGhz implementation is in place
        enhAckPsdu[0] = (0x08U /*FCS=2byte*/ | 0x10U /*Whiten=enabled*/);
        enhAckPsdu[1] = (uint8_t)(__RBIT(enhAckFrame.mLength) >> 24);
    }
    else
    {
        enhAckPsdu[0] = enhAckFrame.mLength;
    }

    enhAckStatus = sl_rail_ieee802154_write_enh_ack(aRailHandle, enhAckPsdu, enhAckFrame.mLength);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    otEXPECT_ACTION(enhAckStatus == SL_RAIL_STATUS_NO_ERROR, railDebugCounters.mRailEventsEnhAckTxFailed++);
#else
    otEXPECT(enhAckStatus == SL_RAIL_STATUS_NO_ERROR);
#endif

exit:
    return true;
}
#endif // (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

//------------------------------------------------------------------------------
// RAIL callbacks

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void dataRequestCommandCallback(sl_rail_handle_t aRailHandle)
{
#define MAX_EXPECTED_BYTES (2U + 2U + 1U) // PHR + FCF + DSN

    uint8_t                  receivedPsdu[IEEE802154_MAX_LENGTH];
    uint8_t                  pktOffset = PHY_HEADER_SIZE;
    uint8_t                  initialPktReadBytes;
    sl_rail_rx_packet_info_t packetInfo;
    uint32_t                 rxCallbackTimestamp = otPlatAlarmMicroGetNow();

    // This callback occurs after the address fields of an incoming
    // ACK-requesting CMD or DATA frame have been received and we
    // can do a frame pending check.  We must also figure out what
    // kind of ACK is being requested -- Immediate or Enhanced.

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
    if (writeIeee802154EnhancedAck(aRailHandle, &packetInfo, rxCallbackTimestamp, &initialPktReadBytes, receivedPsdu))
    {
        // We also return true above if there were failures in
        // generating an enhanced ACK.
        return;
    }
#else
    OT_UNUSED_VARIABLE(rxCallbackTimestamp);
    initialPktReadBytes =
        readInitialPacketData(&packetInfo, MAX_EXPECTED_BYTES, pktOffset + 2, receivedPsdu, MAX_EXPECTED_BYTES);
#endif

    // Calculate frame pending for immediate-ACK
    // If not, RAIL will send an immediate ACK, but we need to do FP lookup.
    sl_rail_status_t status = SL_RAIL_STATUS_NO_ERROR;

    // Check if we read the FCF, if not, set macFcf to 0
    uint16_t macFcf = (initialPktReadBytes <= pktOffset) ? 0U : receivedPsdu[pktOffset];

    bool framePendingSet = false;

    if (sli_ot_radio_interface_is_src_match_enabled())
    {
        sl_rail_ieee802154_address_t sourceAddress;

        status = sl_rail_ieee802154_get_address(aRailHandle, &sourceAddress);
        otEXPECT(status == SL_RAIL_STATUS_NO_ERROR);

        otInstance *instance = sli_ot_radio_instance_from_filter_mask(packetInfo.filter_mask);
        if (instance != nullptr
            && ((sourceAddress.address_length == SL_RAIL_IEEE802154_LONG_ADDRESS
                 && utilsSoftSrcMatchExtFindEntry(instance, (otExtAddress *)sourceAddress.long_address) >= 0)
                || (sourceAddress.address_length == SL_RAIL_IEEE802154_SHORT_ADDRESS
                    && utilsSoftSrcMatchShortFindEntry(instance, sourceAddress.short_address) >= 0)))
        {
            status = sl_rail_ieee802154_toggle_frame_pending(aRailHandle);
            otEXPECT(status == SL_RAIL_STATUS_NO_ERROR);
            framePendingSet = true;
        }
    }
    else if ((macFcf & IEEE802154_FRAME_TYPE_MASK) != IEEE802154_FRAME_TYPE_DATA)
    {
        status = sl_rail_ieee802154_toggle_frame_pending(aRailHandle);
        otEXPECT(status == SL_RAIL_STATUS_NO_ERROR);
        framePendingSet = true;
    }

    if (framePendingSet)
    {
        // Store whether frame pending was set in the outgoing ACK in a reserved
        // bit of the MAC header (cleared later)

        otEXPECT((skipRxPacketLengthBytes(&packetInfo)) == OT_ERROR_NONE);
        uint8_t *macFcfPointer =
            ((packetInfo.first_portion_bytes == 0) ? packetInfo.p_last_portion_data : packetInfo.p_first_portion_data);
        *macFcfPointer |= IEEE802154_FRAME_PENDING_SET_IN_OUTGOING_ACK;
    }

exit:
    if (status == SL_RAIL_STATUS_INVALID_STATE)
    {
        otLogWarnPlat("Too late to modify outgoing FP");
    }
    else
    {
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
    }
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void packetReceivedCallback(void)
{
    sl_rail_rx_packet_info_t    packetInfo;
    sl_rail_rx_packet_details_t packetDetails;
    uint16_t                    length            = 0;
    bool                        framePendingInAck = false;
    bool                        dropPacket        = false;
    otInstance                 *instance          = nullptr;
    sl_status_t                 status;
    bool                        isRxPacketQueued;
    rxBuffer                   *rxPacketBuf = nullptr;

    sl_rail_rx_packet_handle_t packetHandle =
        sli_ot_radio_interface_rail_get_rx_packet_info(SL_RAIL_RX_PACKET_HANDLE_NEWEST, &packetInfo);
    otEXPECT_ACTION((packetHandle != SL_RAIL_RX_PACKET_HANDLE_INVALID
                     && packetInfo.packet_status == SL_RAIL_RX_PACKET_READY_SUCCESS),
                    dropPacket = true);

