youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
    otEXPECT_ACTION(validatePacketDetails(packetHandle, &packetDetails, &packetInfo, &length), dropPacket = true);

    uint8_t macFcf;
    otEXPECT_ACTION((skipRxPacketLengthBytes(&packetInfo)) == OT_ERROR_NONE, dropPacket = true);

    macFcf = ((packetInfo.first_portion_bytes == 0) ? packetInfo.p_last_portion_data[0]
                                                    : packetInfo.p_first_portion_data[0]);

    instance = sli_ot_radio_instance_from_filter_mask(packetInfo.filter_mask);

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    // Drop packet if instance is nullptr and it's not a valid case where nullptr is expected
    // Valid nullptr cases: Case 1 (broadcast) or Case 3 (missing addressing info)
    otEXPECT_ACTION(!(instance == nullptr && !isFilterMaskBroadcast(packetInfo.filter_mask)
                      && !isFilterMaskMissingAddressing(packetInfo.filter_mask)),
                    dropPacket = true);
#endif

    if (packetDetails.is_ack)
    {
        otEXPECT_ACTION(
            (length >= IEEE802154_MIN_LENGTH && (macFcf & IEEE802154_FRAME_TYPE_MASK) == IEEE802154_FRAME_TYPE_ACK),
            dropPacket = true);

        // read packet
        sli_ot_radio_interface_rail_copy_rx_packet(sReceiveAck.frame.mPsdu, &packetInfo);

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailEventAcksReceived++;
#endif
        sReceiveAck.frame.mLength = length;

        sli_ot_radio_events_handle_phy_stack_event(
            SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ENDED,
            static_cast<uint32_t>(sli_ot_radio_interface_rail_is_receiving_frame()));

        if (txWaitingForAck()
            && (sReceiveAck.frame.mPsdu[IEEE802154_DSN_OFFSET] == sCurrentTxPacket->frame.mPsdu[IEEE802154_DSN_OFFSET]))
        {
            otEXPECT_ACTION(validatePacketTimestamp(&packetDetails, length), dropPacket = true);

            sReceiveAck.frame.mInfo.mRxInfo.mRssi = packetDetails.rssi_dbm;
            sReceiveAck.frame.mInfo.mRxInfo.mLqi  = packetDetails.lqi;
            sReceiveAck.instance                  = instance;
            updateRxFrameTimestamp(true, packetDetails.time_received.packet_time);

            // Processing the ACK frame in ISR context avoids the Tx state to be messed up,
            // in case the Rx FIFO queue gets wiped out in a DMP situation.
            sli_ot_radio_state_set_tx_success(true);
            sli_ot_radio_state_clear_tx_data_and_wait_for_ack();

            framePendingInAck = ((macFcf & IEEE802154_FRAME_FLAG_FRAME_PENDING) != 0);
            sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_ACK_RECEIVED,
                                                       static_cast<uint32_t>(framePendingInAck));

            if (txIsDataRequest() && framePendingInAck)
            {
                sli_ot_radio_state_set_em_pending_data(true);
            }
        }
        // Yield the radio upon receiving an ACK as long as it is not related to
        // a data request.
        if (!txIsDataRequest())
        {
            sli_ot_radio_interface_rail_yield_radio();
        }
    }
    else
    {
        otEXPECT_ACTION(sli_ot_radio_interface_get_promiscuous() || (length >= IEEE802154_MIN_DATA_LENGTH),
                        dropPacket = true);

        otEXPECT_ACTION(validatePacketTimestamp(&packetDetails, length), dropPacket = true);

        // Drop the packet if queue is full.
        otEXPECT_ACTION(!queueIsFull(&sRxPacketQueue), dropPacket = true);
        // Allocate a block from memory pool for the received packet.
        status = sl_memory_pool_alloc(&sRxPacketMemPoolHandle, (void **)&rxPacketBuf);
        // Drop the packet if no more memory block present in the pool to store it.
        otEXPECT_ACTION(status == SL_STATUS_OK && rxPacketBuf != nullptr, dropPacket = true);

        // read packet
        sli_ot_radio_interface_rail_copy_rx_packet(rxPacketBuf->psdu, &packetInfo);

        rxPacketBuf->packetInfo.length    = (uint8_t)length;
        rxPacketBuf->packetInfo.channel   = (uint8_t)packetDetails.channel;
        rxPacketBuf->packetInfo.rssi      = packetDetails.rssi_dbm;
        rxPacketBuf->packetInfo.lqi       = packetDetails.lqi;
        rxPacketBuf->packetInfo.timestamp = packetDetails.time_received.packet_time;
        // Set instance to nullptr for broadcast packets in multi-instance mode, specific instance otherwise
#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
        rxPacketBuf->packetInfo.instance =
            sli_ot_radio_instance_is_filter_mask_broadcast_pan(packetInfo.filter_mask) ? nullptr : instance;
#else
        rxPacketBuf->packetInfo.instance = instance;
#endif

        // Queue the rx packet or drop it if queueing fails and free the memory block.
        isRxPacketQueued = queueAdd(&sRxPacketQueue, (void *)rxPacketBuf);
        otEXPECT_ACTION(isRxPacketQueued, dropPacket = true);

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailPlatRadioReceiveProcessedCount++;
#endif

        if (macFcf & IEEE802154_FRAME_FLAG_ACK_REQUIRED)
        {
            sli_ot_radio_events_handle_phy_stack_event(
                (sli_ot_radio_interface_rail_is_rx_auto_ack_paused()
                     ? SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ACK_BLOCKED
                     : SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ACKING),
                static_cast<uint32_t>(sli_ot_radio_interface_rail_is_receiving_frame()));
            sli_ot_radio_state_set_tx_ack_ongoing(true);
        }
        else
        {
            sli_ot_radio_events_handle_phy_stack_event(
                SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ENDED,
                static_cast<uint32_t>(sli_ot_radio_interface_rail_is_receiving_frame()));
            // We received a frame that does not require an ACK as result of a data
            // poll: we yield the radio here.
            if (sli_ot_radio_state_get_em_pending_data())
            {
                sli_ot_radio_interface_rail_yield_radio();
                sli_ot_radio_state_set_em_pending_data(false);
            }
        }
    }
exit:
    if (dropPacket)
    {
        sli_ot_radio_events_handle_phy_stack_event(
            SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_CORRUPTED,
            static_cast<uint32_t>(sli_ot_radio_interface_rail_is_receiving_frame()));

        (void)sl_memory_pool_free(&sRxPacketMemPoolHandle, rxPacketBuf);
    }
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void packetSentCallback(bool isAck)
{
    if (isAck)
    {
        // We successfully sent out an ACK.
        sli_ot_radio_state_set_tx_ack_ongoing(false);
        // We acked the packet we received after a poll: we can yield now.
        if (sli_ot_radio_state_get_em_pending_data())
        {
            sli_ot_radio_interface_rail_yield_radio();
            sli_ot_radio_state_set_em_pending_data(false);
        }
    }
    else if (sli_ot_radio_state_is_tx_data_ongoing())
    {
        sli_ot_radio_state_set_using_csma(false);

