youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
        if (txWaitingForAck())
        {
            sli_ot_radio_state_set_waiting_for_ack(true);
            sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_ACK_WAITING, 0U);
        }
        else
        {
            sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_ENDED, 0U);
            sli_ot_radio_interface_rail_yield_radio();
            sli_ot_radio_state_set_tx_success(true);
            // Broadcast packet clear the ONGOING flag here.
            sli_ot_radio_state_set_tx_data_ongoing(false);
            sli_ot_radio_state_set_scheduled_tx_started(false);
        }
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailEventPacketSent++;
#endif
    }
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void txFailedCallback(bool isAck, uint32_t status)
{
    if (isAck)
    {
        sli_ot_radio_state_set_tx_ack_ongoing(false);
    }
    else if (sli_ot_radio_state_is_tx_data_ongoing())
    {
        if (status == EVENT_TX_CCA_FAILED)
        {
            sli_ot_radio_state_set_tx_cca_failed(true);
            sli_ot_radio_state_set_using_csma(false);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
            railDebugCounters.mRailEventChannelBusy++;
#endif
        }
        else
        {
            sli_ot_radio_state_set_tx_failed(true);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
            railDebugCounters.mRailEventTxAbort++;
#endif
        }
        sli_ot_radio_state_clear_tx_data_and_wait_for_ack();
        sli_ot_radio_interface_rail_yield_radio();
    }
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void ackTimeoutCallback(void)
{
    OT_ASSERT(txWaitingForAck());
    OT_ASSERT(sli_ot_radio_state_is_waiting_for_ack());

    sli_ot_radio_state_set_tx_no_ack(true);
    sli_ot_radio_state_set_tx_data_ongoing(false);
    sli_ot_radio_state_set_scheduled_tx_started(false);

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    railDebugCounters.mRailEventNoAck++;
#endif

#ifdef SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT
    // If antenna diversity is enabled toggle the selected antenna.
    sl_rail_util_ant_div_toggle_tx_antenna();
#endif // SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT
    // TO DO: Check if we have an OT function that
    // provides the number of mac retry attempts left
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_ACK_TIMEDOUT, 0);

    sli_ot_radio_state_set_waiting_for_ack(false);
    sli_ot_radio_interface_rail_yield_radio();
    sli_ot_radio_state_set_em_pending_data(false);
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
void schedulerEventCallback(sl_rail_handle_t aRailHandle)
{
    sl_rail_scheduler_status_t scheduler_status;
    sl_rail_status_t           rail_status;
    sl_rail_get_scheduler_status(aRailHandle, &scheduler_status, &rail_status);
    if (scheduler_status != SL_RAIL_SCHEDULER_STATUS_NO_ERROR)
    {
        sli_ot_radio_state_clear_all_scheduled_events();
        if (sli_ot_radio_state_is_tx_ack_ongoing())
        {
            sli_ot_radio_events_handle_phy_stack_event(
                SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_ACK_ABORTED,
                static_cast<uint32_t>(sli_ot_radio_interface_rail_is_receiving_frame()));
            txFailedCallback(true, EVENT_TX_FAILED);
        }
        // We were in the process of TXing a data frame, treat it as a CCA_FAIL.
        if (sli_ot_radio_state_is_tx_data_ongoing())
        {
            sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_BLOCKED,
                                                       static_cast<uint32_t>(txWaitingForAck()));
            txFailedCallback(false, EVENT_TX_CCA_FAILED);
        }
        // We are waiting for an ACK: we will never get the ACK we were waiting for.
        // We want to call ackTimeoutCallback() only if the PACKET_SENT event
        // already fired (which would clear the FLAG_ONGOING_TX_DATA flag).
        if (sli_ot_radio_state_is_waiting_for_ack())
        {
            ackTimeoutCallback();
        }

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailEventSchedulerStatusError++;
#endif
    }
}

//------------------------------------------------------------------------------
// Main thread packet handling

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool validatePacketDetails(sl_rail_rx_packet_handle_t      packetHandle,
                                  sl_rail_rx_packet_details_t    *pPacketDetails,
                                  const sl_rail_rx_packet_info_t *pPacketInfo,
                                  uint16_t                       *packetLength)
{
    bool             pktValid = true;
    sl_rail_status_t rStatus;
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    rxDebugStep = 0;
#endif

    rStatus = sli_ot_radio_interface_rail_get_rx_packet_details(packetHandle, pPacketDetails);
    otEXPECT_ACTION(rStatus == SL_RAIL_STATUS_NO_ERROR, pktValid = false);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    rxDebugStep++;
#endif

    otEXPECT_ACTION(isFilterMaskValid(pPacketInfo->filter_mask), pktValid = false);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    rxDebugStep++;
#endif

    // RAIL's packetBytes includes the (1 or 2 byte) PHY header but not the 2-byte CRC.
    // We want *packetLength to match the PHY header length so we add 2 for CRC
    // and subtract the PHY header size.
    *packetLength = pPacketInfo->packet_bytes + 2U - PHY_HEADER_SIZE;

    if (PHY_HEADER_SIZE == 1)
    {
        otEXPECT_ACTION(*packetLength == pPacketInfo->p_first_portion_data[0], pktValid = false);
    }
    else
    {
        uint8_t lengthByte = ((pPacketInfo->first_portion_bytes > 1) ? pPacketInfo->p_first_portion_data[1]
                                                                     : pPacketInfo->p_last_portion_data[0]);
        otEXPECT_ACTION(*packetLength == (uint16_t)(__RBIT(lengthByte) >> 24), pktValid = false);
    }
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    rxDebugStep++;
#endif

    // check the length validity of recv packet; RAIL should take care of this.
    otEXPECT_ACTION((*packetLength >= IEEE802154_MIN_LENGTH && *packetLength <= IEEE802154_MAX_LENGTH),
                    pktValid = false);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    rxDebugStep++;
#endif

