youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
exit:
#if (OPENTHREAD_CONFIG_LOG_LEVEL == OT_LOG_LEVEL_DEBG)
    if (!pktValid)
    {
        otLogDebgPlat("RX Pkt Invalid: rStatus=0x%lX, filterMask=0x%2X, pktLen=%i",
                      rStatus,
                      pPacketInfo->filter_mask,
                      *packetLength);
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        otLogDebgPlat("RX debug step=%i", rxDebugStep);
#endif
    }
#endif
    return pktValid;
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static bool validatePacketTimestamp(sl_rail_rx_packet_details_t *pPacketDetails, uint16_t packetLength)
{
    bool rxTimestampValid = true;

    // Get the timestamp when the SFD was received
    otEXPECT_ACTION(pPacketDetails->time_received.time_position != SL_RAIL_PACKET_TIME_INVALID,
                    rxTimestampValid = false);

    // + PHY HEADER SIZE for PHY header
    // We would not need this if PHR is not included and we want the MHR
    pPacketDetails->time_received.total_packet_bytes = packetLength + PHY_HEADER_SIZE;

    otEXPECT_ACTION((sli_ot_radio_interface_rail_get_rx_time_sync_word_end(pPacketDetails) == SL_RAIL_STATUS_NO_ERROR),
                    rxTimestampValid = false);
exit:
    return rxTimestampValid;
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static void updateRxFrameTimestamp(bool aIsAckFrame, sl_rail_time_t aTimestamp)
{
    // Current time > sync-receive timestamp
    // Therefore lower 32 bits of current time should always be greater than lower 32 bits
    // of sync-rx timestamp unless there is a overflow.  In such cases, we do not want to
    // take overflow into consideration for sync-rx timestamp.
    uint64_t railUsTimeNow    = otPlatTimeGet();
    uint32_t railUsTimerWraps = railUsTimeNow >> 32;

    // Address multiple overflows, such as what would happen if the current time overflows
    // from 0x00000001FFFFFFFF to 0x0000000200000000 (leave the higher 32 bits as 0)
    if ((railUsTimeNow & 0xFFFFFFFF) <= aTimestamp)
    {
        railUsTimerWraps--;
    }

    if (aIsAckFrame)
    {
        sReceiveAck.frame.mInfo.mRxInfo.mTimestamp = aTimestamp + ((uint64_t)railUsTimerWraps << 32);
    }
    else
    {
        sReceive.frame.mInfo.mRxInfo.mTimestamp = aTimestamp + ((uint64_t)railUsTimerWraps << 32);
    }
}

SL_CODE_CLASSIFY(SL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION, SL_CODE_CLASS_TIME_CRITICAL)
static otError skipRxPacketLengthBytes(sl_rail_rx_packet_info_t *pPacketInfo)
{
    otError error = OT_ERROR_NONE;
    otEXPECT_ACTION(pPacketInfo->first_portion_bytes > 0, error = OT_ERROR_FAILED);

    pPacketInfo->p_first_portion_data += PHY_HEADER_SIZE;
    pPacketInfo->packet_bytes -= PHY_HEADER_SIZE;

    if (PHY_HEADER_SIZE == 1 || pPacketInfo->first_portion_bytes > 1)
    {
        pPacketInfo->first_portion_bytes -= PHY_HEADER_SIZE;
    }
    else
    {
        pPacketInfo->first_portion_bytes = 0U;
        // Increment lastPortionData to skip the second byte of the PHY header
        otEXPECT_ACTION(pPacketInfo->p_last_portion_data != nullptr, error = OT_ERROR_FAILED);
        pPacketInfo->p_last_portion_data++;
    }

exit:
    return error;
}

static rxBuffer *prepareNextRxPacketforCb(void)
{
    rxBuffer *rxPacketBuf = (rxBuffer *)queueRemove(&sRxPacketQueue);
    OT_ASSERT(rxPacketBuf != nullptr);
    uint8_t *psdu = rxPacketBuf->psdu;

    // Check reserved bits in MAC header for enhanced ACK security status
    sReceive.frame.mInfo.mRxInfo.mAckedWithSecEnhAck = ((*psdu & IEEE802154_SECURED_OUTGOING_ENHANCED_ACK) != 0);
    *psdu &= ~IEEE802154_SECURED_OUTGOING_ENHANCED_ACK;

    // Check reserved bits in MAC header for frame pending status
    sReceive.frame.mInfo.mRxInfo.mAckedWithFramePending = ((*psdu & IEEE802154_FRAME_PENDING_SET_IN_OUTGOING_ACK) != 0);
    *psdu &= ~IEEE802154_FRAME_PENDING_SET_IN_OUTGOING_ACK;

    sReceive.frame.mChannel = rxPacketBuf->packetInfo.channel;
    sReceive.frame.mLength  = rxPacketBuf->packetInfo.length;
    sReceive.frame.mPsdu    = rxPacketBuf->psdu;

    sReceive.frame.mInfo.mRxInfo.mRssi = rxPacketBuf->packetInfo.rssi;
    sLastRssi                          = rxPacketBuf->packetInfo.rssi;

    sReceive.frame.mInfo.mRxInfo.mLqi = rxPacketBuf->packetInfo.lqi;
    sLastLqi                          = rxPacketBuf->packetInfo.lqi;

    // Set instance (nullptr indicates broadcast packet)
    sReceive.instance = rxPacketBuf->packetInfo.instance;

    // Security key fields are populated per-instance in deliverRxPacketToInstance()

    updateRxFrameTimestamp(false, rxPacketBuf->packetInfo.timestamp);
    return rxPacketBuf;
}

static inline bool isRxPacketBroadcast(void)
{
    return (sReceive.instance == nullptr);
}

static void deliverRxPacketToInstance(otInstance *aInstance)
{
    OT_ASSERT(aInstance != nullptr);

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    sReceive.frame.mInfo.mRxInfo.mAckKeyId        = sli_ot_radio_security_get_ack_key_id(aInstance);
    sReceive.frame.mInfo.mRxInfo.mAckFrameCounter = sli_ot_radio_security_get_ack_frame_counter(aInstance);
#endif

#if OPENTHREAD_CONFIG_MULTIPAN_RCP_ENABLE
    sl_gp_intf_should_buffer_pkt(aInstance, &sReceive.frame, true);
#else
    bool isGpPacket = sl_gp_intf_is_gp_pkt(&sReceive.frame);
    otEXPECT(!isGpPacket);
#endif

    otPlatRadioReceiveDone(aInstance, &sReceive.frame, sReceiveError);

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
    railDebugCounters.mRailPlatRadioReceiveDoneCbCount++;
#endif

#if !OPENTHREAD_CONFIG_MULTIPAN_RCP_ENABLE
exit:
    return;
#endif
}

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
static void processBroadcastRxPacket(void)
{
    for (uint8_t i = 0; i < RADIO_INTERFACE_COUNT; i++)
    {
        otInstance *instance = sli_ot_radio_instance_get(i);
        if (instance != nullptr && otInstanceIsInitialized(instance))
        {
            deliverRxPacketToInstance(instance);
        }
    }
}
#endif

static void processNextRxPacket(otInstance *aInstance)
{
    sReceiveError         = OT_ERROR_NONE;
    rxBuffer *rxPacketBuf = prepareNextRxPacketforCb();

