youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    OT_UNUSED_VARIABLE(aInstance);

    if (isRxPacketBroadcast())
    {
        processBroadcastRxPacket();
    }
    else
    {
        deliverRxPacketToInstance(sReceive.instance);
    }
#else
    deliverRxPacketToInstance(aInstance);
#endif

    (void)sl_memory_pool_free(&sRxPacketMemPoolHandle, rxPacketBuf);
    otSysEventSignalPending();
}

static void processRxPackets(otInstance *aInstance)
{
    while (!queueIsEmpty(&sRxPacketQueue))
    {
        processNextRxPacket(aInstance);
    }
}

static void processTxComplete(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    otError       txStatus;
    otRadioFrame *ackFrame = nullptr;

    if (sli_ot_radio_state_has_tx_events())
    {
        if (sli_ot_radio_state_has_tx_success())
        {
            txStatus = OT_ERROR_NONE;

            if (sCurrentTxPacket->frame.mPsdu[0] & IEEE802154_FRAME_FLAG_ACK_REQUIRED)
            {
                ackFrame = &sReceiveAck.frame;
            }

            sli_ot_radio_state_set_tx_success(false);
        }
        else if (sli_ot_radio_state_has_tx_cca_failed())
        {
            txStatus = OT_ERROR_CHANNEL_ACCESS_FAILURE;
            sli_ot_radio_state_set_tx_cca_failed(false);
        }
        else if (sli_ot_radio_state_has_tx_no_ack())
        {
            txStatus = OT_ERROR_NO_ACK;
            sli_ot_radio_state_set_tx_no_ack(false);
        }
        else
        {
            txStatus = OT_ERROR_ABORT;
            sli_ot_radio_state_set_tx_failed(false);
        }

        if (txStatus != OT_ERROR_NONE)
        {
            otLogDebgPlat("Transmit failed ErrorCode=%d", txStatus);
        }

        // Clear any internally-set txDelays so future transmits are not affected.
        sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelayBaseTime = 0;
        sCurrentTxPacket->frame.mInfo.mTxInfo.mTxDelay         = 0;

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
        CORE_DECLARE_IRQ_STATE;
        CORE_ENTER_ATOMIC();

        sli_ot_radio_instance_set_tx_busy(false);

        CORE_EXIT_ATOMIC();
#endif
        otPlatRadioTxDone(sCurrentTxPacket->instance, &sCurrentTxPacket->frame, ackFrame, txStatus);

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        railDebugCounters.mRailPlatRadioTxDoneCbCount++;
#endif
        otSysEventSignalPending();
    }
}

void efr32RadioProcess(otInstance *aInstance)
{
    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TICK, 0U);

    // We should process the received packet first. Adding it at the end of this function,
    // will delay the stack notification until the next call to efr32RadioProcess()
    processRxPackets(aInstance);
    processTxComplete(aInstance);
    sli_ot_energy_scan_process(aInstance);

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    sli_ot_radio_instance_process_commands();
#endif // OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
}

//------------------------------------------------------------------------------
// Antenna Diversity, Wifi coexistence and Runtime PHY select support

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT

otError setRadioState(otRadioState state)
{
    otError error = OT_ERROR_NONE;

    // Defer idling the radio if we have an ongoing TX task
    otEXPECT_ACTION(!sli_ot_radio_state_is_tx_data_ongoing(), error = OT_ERROR_FAILED);

    switch (state)
    {
    case OT_RADIO_STATE_RECEIVE:
        otEXPECT_ACTION(sli_ot_radio_interface_set_rx(sReceive.frame.mChannel) == OT_ERROR_NONE,
                        error = OT_ERROR_FAILED);
        break;
    case OT_RADIO_STATE_SLEEP:
        sli_ot_radio_state_set_idle();
        break;
    default:
        error = OT_ERROR_FAILED;
    }
exit:
    return error;
}

void sl_ot_update_active_radio_config(void)
{
    CORE_DECLARE_IRQ_STATE;
    otRadioState currentState;

    CORE_ENTER_ATOMIC();

    // Proceed with PHY selection only if 2.4 GHz band is used
    otEXPECT(sli_ot_radio_interface_get_band_config_ptr()->mChannelConfig == nullptr);

    currentState = otPlatRadioGetState(nullptr);
    otEXPECT(setRadioState(OT_RADIO_STATE_SLEEP) == OT_ERROR_NONE);
    sli_ot_radio_interface_rail_config_radio();
    otEXPECT(setRadioState(currentState) == OT_ERROR_NONE);

exit:
    CORE_EXIT_ATOMIC();
    return;
}
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

static void changeDynamicEvents(void)
{
    /* clang-format off */
  const sl_rail_events_t eventMask = SL_RAIL_EVENTS_NONE
                                     | SL_RAIL_EVENT_RX_SYNC_0_DETECT
                                     | SL_RAIL_EVENT_RX_SYNC_1_DETECT
                                     | SL_RAIL_EVENT_RX_FRAME_ERROR
                                     | SL_RAIL_EVENT_RX_FIFO_OVERFLOW
                                     | SL_RAIL_EVENT_RX_ADDRESS_FILTERED
                                     | SL_RAIL_EVENT_RX_PACKET_ABORTED
                                     | SL_RAIL_EVENT_RX_FILTER_PASSED
                                     | SL_RAIL_EVENT_TX_CHANNEL_CLEAR
                                     | SL_RAIL_EVENT_TX_CCA_RETRY
                                     | SL_RAIL_EVENT_TX_START_CCA
                                     | SL_RAIL_EVENT_SIGNAL_DETECTED;
    /* clang-format on */
    sl_rail_events_t eventValues = SL_RAIL_EVENTS_NONE;

    if (phyStackEventIsEnabled())
    {
        eventValues |= eventMask;
    }
    sli_ot_radio_events_update_config(eventMask, eventValues);
}
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT

static void efr32PhyStackInit(void)
{
#ifdef SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT
    sli_ot_radio_interface_init_antenna_config();
#endif // SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
    efr32CoexInit();
#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_STACK_EVENT_PRESENT
    changeDynamicEvents();
#endif
}

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT

static void emRadioEnableAutoAck(void)
{
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();

    if (sli_ot_radio_state_is_initialized())
    {
        if ((sRhoActive >= RHO_INT_ACTIVE) // Internal always holds ACKs
            || ((sRhoActive > RHO_INACTIVE)
                && ((sl_rail_util_coex_get_options() & SL_RAIL_UTIL_COEX_OPT_ACK_HOLDOFF)
                    != SL_RAIL_UTIL_COEX_OPT_DISABLED)))
        {
            sli_ot_radio_interface_rail_pause_rx_auto_ack(true);
        }
        else
        {
            sli_ot_radio_interface_rail_pause_rx_auto_ack(false);
        }
    }
    CORE_EXIT_ATOMIC();
}

static void emRadioEnablePta(bool enable)
{
    halInternalInitPta();

