youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio.cpp
    // When PTA is enabled, we want to negate PTA_REQ as soon as an incoming
    // frame is aborted, e.g. due to filtering.  To do that we must turn off
    // the TRACKABFRAME feature that's normally on to benefit sniffing on PTI.
    sl_rail_status_t status = sli_ot_radio_interface_rail_config_rx_options(
        SL_RAIL_RX_OPTION_TRACK_ABORTED_FRAMES,
        (enable ? SL_RAIL_RX_OPTIONS_NONE : SL_RAIL_RX_OPTION_TRACK_ABORTED_FRAMES));
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
}

static void efr32CoexInit(void)
{
#if SL_OPENTHREAD_COEX_COUNTER_ENABLE && defined(SL_CATALOG_RAIL_MULTIPLEXER_PRESENT)
    sli_ot_radio_interface_rail_set_coex_counter_handler((void *)(&sli_ot_radio_coex_counter_on_event));
#else
    sli_radio_coex_reset();
#endif // SL_OPENTHREAD_COEX_COUNTER_ENABLE && defined(SL_CATALOG_RAIL_MULTIPLEXER_PRESENT)

#if OPENTHREAD_CONFIG_PLATFORM_RADIO_COEX_ENABLE
#if defined(SL_RAIL_UTIL_COEX_REQ_GPIO) || defined(SL_RAIL_UTIL_COEX_REQ_PORT) || defined(SL_RAIL_UTIL_COEX_GNT_GPIO) \
    || defined(SL_RAIL_UTIL_COEX_GNT_PORT) || SL_RAIL_UTIL_COEX_RUNTIME_PHY_SELECT
    sl_rail_util_ot_enable_coex_state_event_filter();
#endif
#endif // OPENTHREAD_CONFIG_PLATFORM_RADIO_COEX_ENABLE

    sl_rail_util_coex_options_t coexOptions = sl_rail_util_coex_get_options();

#if SL_OPENTHREAD_COEX_MAC_HOLDOFF_ENABLE
    coexOptions |= SL_RAIL_UTIL_COEX_OPT_MAC_HOLDOFF;
#else
    if (sl_rail_util_coex_get_radio_holdoff())
    {
        coexOptions |= SL_RAIL_UTIL_COEX_OPT_MAC_HOLDOFF;
    }
#endif // SL_OPENTHREAD_COEX_MAC_HOLDOFF_ENABLE

    sl_rail_util_coex_set_options(coexOptions);

    emRadioEnableAutoAck(); // Might suspend AutoACK if RHO already in effect
    emRadioEnablePta(sl_rail_util_coex_is_enabled());
}

// Managing radio transmission
static void onPtaGrantTx(sl_rail_util_coex_req_t ptaStatus)
{
    // Only pay attention to first PTA Grant callback, ignore any further ones
    if (sPtaGntEventReported)
    {
        return;
    }
    sPtaGntEventReported = true;

    OT_ASSERT(ptaStatus == SL_RAIL_UTIL_COEX_REQCB_GRANTED);
    // PTA is telling us we've gotten GRANT and should send ASAP *without* CSMA
    sli_ot_radio_state_set_using_csma(false);
    txCurrentPacket();
}

static void tryTxCurrentPacket(void)
{
    OT_ASSERT(sli_ot_radio_state_is_tx_data_ongoing());

    sPtaGntEventReported = false;
    sl_rail_util_ieee802154_stack_event_t ptaStatus =
        sli_ot_radio_events_handle_phy_stack_event_with_status(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_TX_PENDED_MAC,
                                                               reinterpret_cast<uint32_t>(&onPtaGrantTx));
    if (ptaStatus == SL_RAIL_UTIL_IEEE802154_STACK_STATUS_SUCCESS)
    {
        // Normal case where PTA allows us to start the (CSMA) transmit below
        txCurrentPacket();
    }
    else if (ptaStatus == SL_RAIL_UTIL_IEEE802154_STACK_STATUS_CB_PENDING)
    {
        // onPtaGrantTx() callback will take over (and might already have)
    }
    else if (ptaStatus == SL_RAIL_UTIL_IEEE802154_STACK_STATUS_HOLDOFF)
    {
        txFailedCallback(false, EVENT_TX_FAILED);
    }
}

// Managing CCA Threshold
static void setCcaThreshold(void)
{
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    int8_t thresholddBm = sli_ot_radio_interface_get_cca_threshold();

    if (sli_ot_radio_state_is_initialized())
    {
        if (sRhoActive > RHO_INACTIVE)
        {
            thresholddBm = SL_RAIL_RSSI_INVALID_DBM;
        }
        sl_rail_status_t status = sli_ot_radio_interface_rail_set_cca_threshold(thresholddBm);
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
    }
    CORE_EXIT_ATOMIC();
}

static void emRadioHoldOffInternalIsr(uint8_t active)
{
    if (active != sRhoActive)
    {
        sRhoActive = active; // Update sRhoActive early
        if (sli_ot_radio_state_is_initialized())
        {
            setCcaThreshold();
            emRadioEnableAutoAck();
        }
    }
}

extern "C" {
// External API used by Coex Component
SL_WEAK void emRadioHoldOffIsr(bool active)
{
    emRadioHoldOffInternalIsr((uint8_t)active | (sRhoActive & ~RHO_EXT_ACTIVE));
}
} // extern "C"

#endif // SL_CATALOG_RAIL_UTIL_COEX_PRESENT
